wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
#ifndef _RTL8763_SYSON_REG_H
#define _RTL8763_SYSON_REG_H

/* BTAON_reg from Chinwen */
#define BTAON_REG_0x0               0x0
#define BTAON_REG_0x4               0x4
#define BTAON_REG_0x8               0x8
#define BTAON_REG_0xC               0xC
#define BTAON_REG_0x10              0x10
#define BTAON_REG_0x14              0x14
#define BTAON_REG_0x18              0x18
#define BTAON_REG_0x1C              0x1C

typedef union _BTAON_REG_0x0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_BIAS: 1;                  // 00       rw  1'b0
        uint32_t POW_LDO_PA: 1;                // 01       rw  1'b0
        uint32_t rsvd0: 1;                     // 02       rw  1'b0
        uint32_t POW_LDO533: 1;                // 03       rw  1'b0
        uint32_t POW_LDO_VREF: 1;              // 04       rw  1'b0
        uint32_t POW_LDO_AUX_VREF: 1;          // 05       rw  1'b0
        uint32_t rsvd1: 2;                     // 07:06    rw
        uint32_t POW_LDODIG_PC: 1;             // 08       rw  1'b0
        uint32_t POW_LDODIG: 1;                // 09       rw  1'b0
        uint32_t POW_VCORE_PC: 1;              // 10       rw  1'b0
        uint32_t POW_LDO_AUX_HQ: 1;            // 11       rw  1'b0
        uint32_t POW_LDO_RET: 1;               // 12       rw  1'b0
        uint32_t POW_LDO318: 1;                // 13       rw  1'b0
        uint32_t SWRCORE_POW_HV_SW: 1;         // 14       rw  1'b0
        uint32_t POW_LDODIG_VREF: 1;           // 15       rw  1'b0
        uint32_t rsvd2: 1;                     // 16       rw
        uint32_t POW_VAUDIO_DET: 1;            // 17       rw  1'b0
        uint32_t POW_VAUX_DET: 1;              // 18       rw  1'b0
        uint32_t POW_VDDCORE_DET: 1;           // 19       rw  1'b0
        uint32_t POW_HV_DET: 1;                // 20       rw  1'b0
        uint32_t POW_VBAT_DET: 1;              // 21       rw  1'b0
        uint32_t POW_ADP_DET: 1;               // 22       rw  1'b0
        uint32_t rsvd3: 1;                     // 23       rw
        uint32_t POW_VCORE_PC_VG2: 1;          // 24       rw  1'b0
        uint32_t POW_VCORE_PC_VG1: 1;          // 25       rw  1'b0
        uint32_t rsvd4: 6;                     // 31:26    rw
    };
} BTAON_REG_0x0_TYPE;

typedef union _BTAON_REG_0x4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_M2: 1;                    // 00       rw  1'b0
        uint32_t POW_M1: 1;                    // 01       rw  1'b0
        uint32_t POW_DVDET_M1: 1;              // 02       rw  1'b0
        uint32_t POW_DVDET_M2: 1;              // 03       rw  1'b0
        uint32_t rsvd0: 12;                    // 15:04    rw
        uint32_t reg_POW_32KXTAL: 1;           // 16       rw  1'b1
        uint32_t reg_POW_32KOSC: 1;            // 17       rw  1'b1
        uint32_t rsvd1: 14;                    // 31:18    rw
    };
} BTAON_REG_0x4_TYPE;

typedef union _BTAON_REG_0x8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t VOUT_TUNE_H: 7;               // 06:00    rw  7'b0010000
        uint32_t rsvd0: 9;                     // 15:07    rw
        uint32_t LDO_DIG_TUNE : 5;             // 20:16    rw  5'b10110
        uint32_t rsvd1: 11;                    // 31:21    rw
    };
} BTAON_REG_0x8_TYPE;

/* 0xc
    07:00    rw
    08       rw  ENLDO=1, ENSWR=1 open SWR, ENLDO=0 ENSWR=1 open SWR                                                                                            1'b0
    09       rw  ENLDO=1, ENSWR=0 open LDO                                                                                                                      1'b0
    10       rw  if FPWMDIG=1 and FPWMCTL<0>=0, SWR only PWM mode                                                                                               1'b0
    11       rw  1: enable aon clock, 0: clock gated                                                                                                            1'b1
    12       rw  00: Normal mode, XTAL_LPMODE=0, TCXO_MODE=0, 01: Low power mode, XTAL_LPMODE=1, TCXO_MODE=0, 10: buffer mode, , XTAL_LPMODE=0, TCXO_MODE=1     1'b0
    13       rw  00: Normal mode, XTAL_LPMODE=0, TCXO_MODE=0, 01: Low power mode, XTAL_LPMODE=1, TCXO_MODE=0, 10: buffer mode, , XTAL_LPMODE=0, TCXO_MODE=1     1'b0
    15:14    rw
    16       rw  Power on the crystal oscillator 1: on, 0: off                                                                                                  1'b0
    17       rw
    18       rw  Power on the 40M ring oscillator 1: on, 0: off                                                                                                 1'b0
    22:19    rw
    26:23    rw  tune PFM VOUT voltage ,PFM_VCORE
    31:27    rw
*/
typedef union _BTAON_REG_0xC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t rsvd0: 8;                     // 07:00
        uint32_t ENSWR_AONH: 1;                // 08
        uint32_t ENLDO_AONH: 1;                // 09
        uint32_t FPWMDIG_H: 1;                 // 10
        uint32_t AON_GATED_EN: 1;              // 11
        uint32_t XTAL_MODE_0: 1;               // 12
        uint32_t XTAL_MODE_1: 1;               // 13
        uint32_t rsvd1: 2;                     // 15:14
        uint32_t BT_anapar_pow_xtal: 1;        // 16
        uint32_t rsvd2: 1;                     // 17
        uint32_t POW_OSC40: 1;                 // 18
        uint32_t rsvd3: 4;                     // 22:19
        uint32_t VREFPFM_H: 4;                 // 26:23
        uint32_t rsvd4: 5;                     // 31:27
    };
} BTAON_REG_0xC_TYPE;

/* 0x10
    00       rw
    01       rw  ISO from VCORE power domain to other power domain. 1: ISO, not in scan chain for avoid combinational loop                                      1'b1
    02       rw  ISO from AFE_PLL power domain to other power domain. 1: ISO                                                                                    1'b1
    03       rw  1: iso xtal to digital. 0: iso release                                                                                                         1'b1
    14:04    rw
    15       rw  reset the all RET domain flip-flops 0: reset                                                                                                   1'b1
    16       rw  reset the PON power domain flip-flops 0: reset                                                                                                 1'b0
    17       rw  reset the CORE power domain flip-flops 0: reset                                                                                                1'b0
    31:18    rw
*/
typedef union _BTAON_REG_0x10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ISO_BT_PON: 1;                // 00
        uint32_t ISO_BT_CORE: 1;               // 01
        uint32_t ISO_AFE_PLL: 1;               // 02
        uint32_t ISO_XTAL: 1;                  // 03
        uint32_t rsvd0: 11;                    // 14:04
        uint32_t BT_RET_RSTB: 1;               // 15
        uint32_t BT_PON_RSTB: 1;               // 16
        uint32_t BT_CORE_RSTB: 1;              // 17
        uint32_t rsvd1: 14;                    // 31:18
    };
} BTAON_REG_0x10_TYPE;

/* 0x14
    0:26     rw
    27       rw  1: enable PLL 0: disable PLL                                                                                                                   1'b0
    28       rw                                                                                                                                                 1'b0
    29       rw                                                                                                                                                 1'b0
    30       rw  110: LDO mode, 001: power cut mode. 000: off                                                                                                   1'b0
    31       rw
*/
typedef union _BTAON_REG_0x14_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t rsvd0: 27;                    // 0:26
        uint32_t POW_PLL: 1;                   // 27
        uint32_t PLL_SW_LDO2PWRCUT: 1;         // 28
        uint32_t PLL_POW_LDO_VREF: 1;          // 29
        uint32_t PLL_POW_LDO_OP: 1;            // 30
        uint32_t rsvd1: 1;                     // 31
    };
} BTAON_REG_0x14_TYPE;

/* 0x18
    0:14     rw
    15       rw  Trigger the MODEM data path retention FF restore                                                                                               1'b0
    16       rw  Trigger the MODEM data path retention FF store                                                                                                 1'b0
    17       rw  Trigger the Platform retention FF restore                                                                                                      1'b0
    18       rw  Trigger the Platform retention FF store                                                                                                        1'b0
    19       rw  Trigger the BLE retention FF restore                                                                                                           1'b0
    20       rw  Trigger the BLE retention FF store                                                                                                             1'b0
    21       rw  Trigger the Bluewiz retention FF restore                                                                                                       1'b0
    22       rw  Trigger the Bluewiz retention FF store                                                                                                         1'b0
    23       rw  Trigger the MODEM retention FF restore                                                                                                         1'b0
    24       rw  Trigger the MODEM retention FF store                                                                                                           1'b0
    25       rw  Trigger the RFC retention FF restore                                                                                                           1'b0
    26       rw  Trigger the RFC retention FF store                                                                                                             1'b0
    31:27    rw
*/
typedef union _BTAON_REG_0x18_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t rsvd0: 15;                    // 0:14
        uint32_t DP_MODEM_RESTORE: 1;          // 15
        uint32_t DP_MODEM_STORE: 1;            // 16
        uint32_t PF_RESTORE: 1;                // 17
        uint32_t PF_STORE: 1;                  // 18
        uint32_t BLE_RESTORE: 1;               // 19
        uint32_t BLE_STORE: 1;                 // 20
        uint32_t BZ_RESTORE: 1;                // 21
        uint32_t BZ_STORE: 1;                  // 22
        uint32_t MODEM_RESTORE: 1;             // 23
        uint32_t MODEM_STORE: 1;               // 24
        uint32_t RFC_RESTORE: 1;               // 25
        uint32_t RFC_STORE: 1;                 // 26
        uint32_t rsvd1: 5;                     // 31:27
    };
} BTAON_REG_0x18_TYPE;

/* 0x1c
    00      rw  enter low power state                                                                                                                           1'b0
    01      rw  re-start the power on sequence.                                                                                                                 1'b0
    02      rw  enter power off mode                                                                                                                            1'b0
    03      r                                                                                                                                                   1'b0
    12:04   rw  DPD_R[8:0] is the register set for PMU                                                                                                          9'b111111101
    13      rw  CLK for DPD_R[8:0].     When DPD_RCK is from low to high, the rising edge is used to latch DPD_R[8:0] for PMU.                                  1'b0
    31:14   r                                                                                                                                                   1'b0
*/

typedef union _BTAON_REG_0x1C_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_enter_lps: 1;              // 00
        uint32_t FW_PON_SEQ_RST_N: 1;          // 01
        uint32_t true_power_off: 1;            // 02
        uint32_t rsvd0: 1;                     // 03
        uint32_t DPD_R_0: 1;                   // 04
        uint32_t DPD_R_1: 1;                   // 05
        uint32_t DPD_R_2: 1;                   // 06
        uint32_t DPD_R_3: 1;                   // 07
        uint32_t DPD_R_4: 1;                   // 08
        uint32_t DPD_R_5: 1;                   // 09
        uint32_t DPD_R_6: 1;                   // 10
        uint32_t DPD_R_7: 1;                   // 11
        uint32_t DPD_R_8: 1;                   // 12
        uint32_t DPD_RCK: 1;                   // 13
        uint32_t rsvd1: 18;                    // 31:14
    };
} BTAON_REG_0x1C_TYPE;

/* BTAON_fast_reg from Chinwen */
#define BTAON_FAST_BOOT                 0x0
#define BTAON_FAST_01                   0x1
#define BTAON_FAST_REBOOT_SW_INFO0      0x2
#define BTAON_FAST_REBOOT_SW_INFO1      0x3
#define BTAON_FAST_BOOT_RETRY_CNT       0x4
#define BTAON_FAST_DEBUG_PASSWORD       0x5
#define BTAON_FAST_REF_RESISTANCE_LSB   0x16
#define BTAON_FAST_REF_RESISTANCE_MSB   0x17
#define BTAON_FAST_1A                   0x1a
#define BTAON_FAST_20                   0x20
#define BTAON_FAST_RG0X_AUXADC          0x22
#define BTAON_FAST_RG1X_AUXADC          0x24
#define BTAON_FAST_RG2X_AUXADC          0x26
#define BTAON_FAST_RG3X_AUXADC          0x28
#define BTAON_FAST_RG4X_AUXADC          0x2a
#define BTAON_FAST_RG5X_AUXADC          0x2c
#define BTAON_FAST_RG6X_AUXADC          0x2e
#define BTAON_FAST_RG0X_MBIAS           0x30
#define BTAON_FAST_RG1X_MBIAS           0x32
#define BTAON_FAST_RG2X_MBIAS           0x34
#define BTAON_FAST_RG3X_MBIAS           0x36
#define BTAON_FAST_RG4X_MBIAS           0x38
#define BTAON_FAST_RG5X_MBIAS           0x3a
#define BTAON_FAST_RG6X_MBIAS           0x3c
#define BTAON_FAST_RG7X_MBIAS           0x3e
#define BTAON_FAST_RG8X_MBIAS           0x40
#define BTAON_FAST_FLAG0X_MBIAS         0x44
#define BTAON_FAST_RG0X_CHG             0x46
#define BTAON_FAST_RG1X_CHG             0x48
#define BTAON_FAST_RG2X_CHG             0x4a
#define BTAON_FAST_RG3X_CHG             0x4c
#define BTAON_FAST_FLAG0X_CHG           0x4e
#define BTAON_FAST_RG0X_SWR_CORE        0x50
#define BTAON_FAST_RG2X_SWR_CORE        0x54
#define BTAON_FAST_RG1X_SWR_CORE        0x56
#define BTAON_FAST_RG3X_SWR_CORE        0x58
#define BTAON_FAST_RG9X_SWR_CORE        0x5a
#define BTAON_FAST_RG4X_SWR_CORE        0x5c
#define BTAON_FAST_RG5X_SWR_CORE        0x5e
#define BTAON_FAST_RG10X_SWR_CORE       0x60
#define BTAON_FAST_RG6X_SWR_CORE        0x62
#define BTAON_FAST_RG7X_SWR_CORE        0x64
#define BTAON_FAST_RG8X_SWR_CORE        0x66
#define BTAON_FAST_FLAG0X_SWR_CORE      0x68
#define BTAON_FAST_FLAG1X_SWR_CORE      0x6a
#define BTAON_FAST_FLAG2X_SWR_CORE      0x6c
#define BTAON_FAST_CKOUT0X_SWR_CORE     0x6e
#define BTAON_FAST_RG0X_SWR_AUDIO       0x70
#define BTAON_FAST_RG1X_SWR_AUDIO       0x78
#define BTAON_FAST_RG5X_SWR_AUDIO       0x7e
#define BTAON_FAST_RG2X_SWR_AUDIO       0x80
#define BTAON_FAST_RG3X_SWR_AUDIO       0x82
#define BTAON_FAST_RG4X_SWR_AUDIO       0x86
#define BTAON_FAST_FLAG0X_SWR_AUDIO     0x88
#define BTAON_FAST_FLAG1X_SWR_AUDIO     0x8a
#define BTAON_FAST_FLAG2X_SWR_AUDIO     0x8c
#define BTAON_FAST_CKOUT0X_SWR_AUDIO    0x8e
#define BTAON_FAST_RG0X_LDO1            0x90
#define BTAON_FAST_RG1X_LDO1            0x92
#define BTAON_FAST_RG2X_LDO1            0x94
#define BTAON_FAST_A4                   0xa4
#define BTAON_FAST_RG3X_LDO2            0xa8
#define BTAON_FAST_BT_ANAPAR_LDO_ADDA   0xaa
#define BTAON_FAST_AC                   0xac
#define BTAON_FAST_AE                   0xae
#define BTAON_FAST_B0                   0xb0
#define BTAON_FAST_B2                   0xb2
#define BTAON_FAST_B4                   0xb4
#define BTAON_FAST_B6                   0xb6
#define BTAON_FAST_B8                   0xb8
#define BTAON_FAST_BA                   0xba
#define BTAON_FAST_BC                   0xbc
#define BTAON_FAST_BE                   0xbe
#define BTAON_FAST_C0                   0xc0
#define BTAON_FAST_C2                   0xc2
#define BTAON_FAST_D0                   0xd0
#define BTAON_FAST_D2                   0xd2
#define BTAON_FAST_D4                   0xd4
#define BTAON_FAST_D6                   0xd6
#define BTAON_FAST_D8                   0xd8
#define BTAON_FAST_DA                   0xda
#define BTAON_FAST_DC                   0xdc
#define BTAON_FAST_DE                   0xde
#define BTAON_FAST_E0                   0xe0
#define BTAON_FAST_E2                   0xe2
#define BTAON_FAST_E4                   0xe4
#define BTAON_FAST_E6                   0xe6
#define BTAON_FAST_E8                   0xe8
#define BTAON_FAST_F2                   0xf2
#define BTAON_FAST_F4                   0xf4
#define BTAON_FAST_F6                   0xf6
#define BTAON_FAST_F8                   0xf8
#define BTAON_FAST_FA                   0xfa
#define BTAON_FAST_FC                   0xfc
#define BTAON_FAST_FE                   0xfe
#define BTAON_FAST_100                  0x100
#define BTAON_FAST_10A                  0x10a
#define BTAON_FAST_112                  0x112
#define BTAON_FAST_120                  0x120
#define BTAON_FAST_122                  0x122
#define BTAON_FAST_BT_PAD_SPI_FLASH     0x124
#define BTAON_FAST_BT_PWDPAD            0x12a
#define BTAON_FAST_WK_STATUS            0x12c
#define BTAON_FAST_12E                  0x12e
#define BTAON_FAST_130                  0x130
#define BTAON_FAST_132                  0x132
#define BTAON_FAST_13A                  0x13a
#define BTAON_FAST_13C                  0x13c
#define BTAON_FAST_140                  0x140
#define BTAON_FAST_142                  0x142
#define BTAON_FAST_154                  0x154
#define BTAON_FAST_156                  0x156
#define BTAON_FAST_158                  0x158
#define BTAON_FAST_15E                  0x15e
#define BTAON_FAST_160                  0x160
#define BTAON_FAST_162                  0x162
#define BTAON_FAST_164                  0x164
#define BTAON_FAST_RG0X_LDODIG          0x168
#define BTAON_FAST_172                  0x172
#define BTAON_FAST_174                  0x174
#define BTAON_FAST_176                  0x176
#define BTAON_FAST_178                  0x178
#define BTAON_FAST_17E                  0x17e
#define BTAON_FAST_RTC_AON_WDT          0x190

/* Bit definition of AON FAST register */
/* 0x00 (BOOT) */
typedef union _BTAON_FAST_BOOT_TYPE
{
    uint8_t d8;
    struct
    {
        uint8_t bootup_before:              1;  /* bit[0]: 0: first boot up                     */
        uint8_t need_restore:               1;  /* bit[1]: need restore flow                    */
        uint8_t rsvd1:                      2;  /* bit[3:2]: reserved */
        uint8_t BOOT_STATUS:                4;  /* bit[7:4]: bit mask to see boot flow          */
    };
} BTAON_FAST_BOOT_TYPE;

/* 0x02 (BTAON_FAST_REBOOT_SW_INFO0) */
typedef union _BTAON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint8_t d8;
    struct
    {
        uint8_t ota_valid: 1;               /* bit[0]: ota valid */
        uint8_t is_rom_code_patch: 1;       /* bit[1]: is rom code patch ? */
        uint8_t is_fw_trig_wdg_to: 1;       /* bit[2]: does fw trigger watchdog timeout ? */
        uint8_t is_airplane_mode: 1;        /* bit[3]: does h5 link reset ? */
        uint8_t is_send_patch_end_evt: 1;   /* bit[4]: does we send patch end event ? */
        uint8_t ota_mode: 1;                /* bit[5]: ota mode */
        uint8_t is_hci_mode: 1;             /* bit[6]: switch to hci mode? */
        uint8_t is_single_tone_mode: 1;                   /* bit[7]: reserved */
    };
} BTAON_FAST_REBOOT_SW_INFO0_TYPE;

/* 0x04 (BOOT_RETRY_CNT) */
typedef union _BTAON_FAST_BOOT_RETRY_CNT_TYPE
{
    uint8_t d8;
    struct
    {
        uint8_t efuse_invalid_cnt:          4;  /* bit[3:0]: efuse invalid retry fail count */
        uint8_t flash_invalid_cnt:          4;  /* bit[7:4]: flash invalid retry fail count */
    };
} BTAON_FAST_BOOT_RETRY_CNT_TYPE;

/* 0x1a ( RG1X_32K )
    05:00    rw  adjust 32k osc freq                                                                        6'b100000
    06       rw  -                                                                                          1'b0
    07       rw  bootup_before                                                                              1'b0
    10:08    rw  -                                                                                          3'b000
    15:11    w1o -                                                                                          5'b00000
*/
typedef union _BTAON_FAST_RG1X_32K_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t RCAL_5_0: 6;                  // 05:00
        uint16_t rsvd1: 1;                     // 06
        uint16_t bootup_before: 1;             // 07
        uint16_t rsvd3: 3;                     // 11:08
        uint16_t w1o_rsvd5: 5;                 // 15:12
    };
} BTAON_FAST_RG1X_32K_TYPE;

/* 0x1a
    10:00    rw  -
    11       w1o reg_aon_flash_clk_dis                                                                      1'b0
    12       w1o is_efuse_invalid                                                                           1'b0
    13       w1o is_enable_efuse_read_protect                                                               1'b0
    14       w1o is_enable_efuse_write_protect                                                              1'b0
    15       w1o -
*/
typedef union _BTAON_FAST_0x1A_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t rsvd11: 11;                            // 10:00
        uint16_t reg_aon_flash_clk_dis: 1;              // 11
        uint16_t is_efuse_invalid: 1;                   // 12
        uint16_t is_enable_efuse_read_protect: 1;       // 13
        uint16_t is_enable_efuse_write_protect: 1;      // 14
        uint16_t w1o_rsvd: 1;                           // 15
    };
} BTAON_FAST_0x1A_TYPE;

