wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x20
    01:00    rw  -
    02       w1o reg_aon_dsp_flash_port_dis                                                                 1'b0
    03       w1o reg_aon_hwspi_en_wp                                                                        1'b0
    04       rw  reg_aon_hwspi_en                                                                           1'b0
    05       w1o reg_aon_debug_port_wp                                                                      1'b0
    06       rw  reg_aon_dbg_port                                                                           1'b0
    07       w1o reg_aon_dbg_boot_dis                                                                       1'b0
    08       w1o is_disable_hci_ram_patch                                                                   1'b0
    09       w1o is_disable_hci_flash_access                                                                1'b0
    10       w1o is_disable_hci_system_access                                                               1'b0
    11       w1o is_disable_hci_efuse_access                                                                1'b0
    12       w1o is_disable_hci_bt_test                                                                     1'b0
    13       w1o is_disable_usb_function                                                                    1'b0
    14       w1o is_disable_sdio_function                                                                   1'b0
    15       w1o is_debug_password_invalid                                                                  1'b0
*/
typedef union _BTAON_FAST_0x20_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t rsvd2: 2;                              // 01:00
        uint16_t reg_aon_dsp_flash_port_dis: 1;         // 02
        uint16_t reg_aon_hwspi_en_wp: 1;                // 03
        uint16_t reg_aon_hwspi_en: 1;                   // 04
        uint16_t reg_aon_debug_port_wp: 1;              // 05
        uint16_t reg_aon_dbg_port: 1;                   // 06
        uint16_t reg_aon_dbg_boot_dis: 1;               // 07
        uint16_t is_disable_hci_ram_patch: 1;           // 08
        uint16_t is_disable_hci_flash_access: 1;        // 09
        uint16_t is_disable_hci_system_access: 1;       // 10
        uint16_t is_disable_hci_efuse_access: 1;        // 11
        uint16_t is_disable_hci_bt_test: 1;             // 12
        uint16_t is_disable_usb_function: 1;            // 13
        uint16_t is_disable_sdio_function: 1;           // 14
        uint16_t is_debug_password_invalid: 1;          // 15
    };
} BTAON_FAST_0x20_TYPE;

/* 0x22 ( RG0X_AUXADC )
    00       rw  pow adc                                                                                    1'b0
    01       rw  pow adc refgen                                                                             1'b0
    02       rw  1: clk from external                                                                       1'b0
    03       rw  clk delay                                                                                  1'b0
    05:04    rw  00:0.9V 01:0.95V 10:1V 11:1.05V                                                            2'b10
    06       rw  1: rever ckdata                                                                            1'b0
    08:07    rw  meta detect time 00: short                                                                 2'b00
    09       rw  1: enable meta detect                                                                      1'b0
    15:10    rw  -                                                                                          6'b000000
*/
typedef union _BTAON_FAST_RG0X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_pow: 1;                // 00
        uint16_t AUXADC_pow_ref: 1;            // 01
        uint16_t AUXADC_reg_ck: 1;             // 02
        uint16_t AUXADC_reg_delay: 1;          // 03
        uint16_t AUXADC_reg_vref_sel: 2;       // 05:04
        uint16_t AUXADC_reg_revck: 1;          // 06
        uint16_t AUXADC_reg_cmpdec: 2;         // 08:07
        uint16_t AUXADC_reg_meta: 1;           // 09
        uint16_t AUXADC_Reserved0: 6;          // 15:10
    };
} BTAON_FAST_RG0X_AUXADC_TYPE;

/* 0x24 ( RG1X_AUXADC )
    07:00    rw  input bypass resistor                                                                      8'b00000000
    10:08    rw  ldo voltage 000:0.9V 001:0.95V 010:1.0V 011:1.05V 100:1.1V 101:1.15V 110:1.2V 111:1.25V    3'b100
    11       rw                                                                                             1'b0
    12       rw  1:sel ldo 0:sel power cut                                                                  1'b0
    13       rw  1: double OP current                                                                       1'b0
    15:14    rw  -                                                                                          2'b00
*/
typedef union _BTAON_FAST_RG1X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_bypassen: 8;           // 07:00
        uint16_t AUXADC_LDO_SW: 3;             // 10:08
        uint16_t AUXADC_LDO_VPULSE: 1;         // 11
        uint16_t AUXADC_SEL_LDO: 1;            // 12
        uint16_t AUXADC_DOUBLE_OP_I: 1;        // 13
        uint16_t AUXADC_Reserved1_2: 2;        // 15:14
    };
} BTAON_FAST_RG1X_AUXADC_TYPE;

/* 0x26 ( RG2X_AUXADC:output )
    00       rw  1: enable 5V power cut                                                                     1'b0
    02:01    rw  ldo voltage 00:1.62V 01:1.71V 10:1.8V 11:1.89V                                             2'b01
    03       rw  1: enable 1V power cut                                                                     1'b0
    04       r   pow low power cmp                                                                          1'b1
    05       r   cmp output edge                                                                            1'b0
    08:06    r   000: ch1 111::ch8                                                                          3'b000
    09       rw                                                                                             1'b0
    15:10    rw  -                                                                                          6'b000000
*/
typedef union _BTAON_FAST_RG2X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_en_pc_5V: 1;           // 00
        uint16_t AUXADC_ldo_sel: 2;            // 02:01
        uint16_t AUXADC_en_pc_1V: 1;           // 03
        uint16_t AUXADC_POW_SD: 1;             // 04
        uint16_t AUXADC_SD_POSEDGE: 1;         // 05
        uint16_t AUXADC_ch_num_sd: 3;          // 08:06
        uint16_t AUXADC_PWDPAD1: 1;            // 09
        uint16_t AUXADC_Reserved2: 6;          // 15:10
    };
} BTAON_FAST_RG2X_AUXADC_TYPE;

/* 0x28 ( RG3X_AUXADC:output )
    07:00    r   E[07:00]                                                                                   8'b00000000
    15:08    r   E2[07:00]                                                                                  8'b11111111
*/
typedef union _BTAON_FAST_RG3X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_E: 8;                  // 07:00
        uint16_t AUXADC_E2: 8;                 // 15:08
    };
} BTAON_FAST_RG3X_AUXADC_TYPE;

