wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x2a ( RG4X_AUXADC:output )
    07:00    r   PD[07:00]                                                                                  8'b00000000
    15:08    r   PU[07:00]                                                                                  8'b00000000
*/
typedef union _BTAON_FAST_RG4X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_PD: 8;                 // 07:00
        uint16_t AUXADC_PU: 8;                 // 15:08
    };
} BTAON_FAST_RG4X_AUXADC_TYPE;

/* 0x2c ( RG5X_AUXADC:output )
    07:00    r                                                                                              8'b00000000
    15:08    r                                                                                              8'b00000000
*/
typedef union _BTAON_FAST_RG5X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_SHDN: 8;               // 07:00
        uint16_t AUXADC_SMT: 8;                // 15:08
    };
} BTAON_FAST_RG5X_AUXADC_TYPE;

/* 0x2e ( RG6X_AUXADC:output )
     r   I[7:0]                                                                                             8'b00000000
     r   -                                                                                                  8'b00000000
*/
typedef union _BTAON_FAST_RG6X_AUXADC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AUXADC_I: 8;                  // 07:00
        uint16_t AUXADC_PUPDC: 8;              // 15:08
    };
} BTAON_FAST_RG6X_AUXADC_TYPE;

/* 0x30 ( RG0X_MBIAS )
    00       r   1: enable LDO_PA                                                                           1'b0
    01       rw  1: connect LDO733LQ and LDO533HQ                                                           1'b0
                 0: disconnect LDO733LQ and LDO533HQ
                 enable this power cut after LDO533HQ is enable
    02       r   1: enable LDO533_HQ, default 3.3V                                                          1'b0
    03       r   1: enable VREF of LDO533_HQ and LDOPA                                                      1'b0
    04       r   1: enable BIAS to supply IB for SWR/CHG/LDO                                                1'b0
    06:05    rw  00: ADPSO slowest 11: ADPSO fastest                                                        2'b00
    07       rw  control HV33 Power Cut PAD  (VG2 is larger Power Cut PMOS)                                 1'b1
    08       rw  control HV33 Power Cut PAD  (VG1 is smaller Power Cut PMOS)                                1'b1
    09       rw  control HV33 Power Cut PAD                                                                 1'b1
    10       rw  1: enable hysteresis of DPD Detetor                                                        1'b1
    11       rw  register for codec                                                                         1'b0
    12       r   1: enable POWERCUT PMOS                                                                    1'b0
                 0: enable POWERCUT NMOS
    13       r   1: supply 1.8V for RF (HV18, loading < 100uA)                                              1'b0
    14       rw  1: enable AON 32kHz clock                                                                  1'b1
    15       r   1: enable BIAS to supply IB for USB/PLL/CODEC/AUXADC                                       1'b1
*/
typedef union _BTAON_FAST_RG0X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_LDO_PA: 1;                // 00
        uint16_t PCUT_LDO733_LQ: 1;            // 01
        uint16_t POW_LDO533_HQ: 1;             // 02
        uint16_t POW_LDO533_HQ_VREF: 1;        // 03
        uint16_t POW_BIAS_500nA: 1;            // 04
        uint16_t ADPSS: 2;                     // 06:05
        uint16_t PCUT_MBIAS_VG2_33: 1;         // 07
        uint16_t PCUT_MBIAS_VG1_33: 1;         // 08
        uint16_t PCUT_MBIAS_ESDCTRL: 1;        // 09
        uint16_t EN_DPD_COMP_HYS: 1;           // 10
        uint16_t REG_FOR_CODEC: 1;             // 11
        uint16_t EN_EFUSE_POWERCUT: 1;         // 12
        uint16_t POW_LDO318: 1;                // 13
        uint16_t EN_CLK_32K_AON: 1;            // 14
        uint16_t POW_BIAS_IP: 1;               // 15
    };
} BTAON_FAST_RG0X_MBIAS_TYPE;

/* 0x32 ( RG1X_MBIAS )
    02:00    rw  set 000 to 111 to make output voltage of LDO_PA_VREF from 0V to 0.5V                       3'b000
    05:03    rw  set 000 to 111 to make output voltage of LDO_HV33_HQ_VREF from 0V to 0.5V                  3'b000
    09:06    rw  AUXADC REF 800mV:50mV:50mV def<1000>=450mV                                                 4'b1000
    15:10    rw  output voltage of LDO733_LQ (default = 3.0V (smaller than LDO533_HQ))                      6'b101101
*/
typedef union _BTAON_FAST_RG1X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t VR_SEL_LDO_PA: 3;             // 02:00
        uint16_t VR_SEL_LDO533_HQ: 3;          // 05:03
        uint16_t VR_SEL_AUXADC: 4;             // 09:06
        uint16_t LDO733_LQ_TUNE: 6;            // 15:10
    };
} BTAON_FAST_RG1X_MBIAS_TYPE;

/* 0x34 ( RG2X_MBIAS )
    04:00    r   DPD R0-R4 DFF is reset by DVDD_DET                                                         5'b11101
    08:05    r   DPD R8-R5 DFF is reset by POR733DPD&HW_RST_N                                               4'b0111
    09       r   CK signal of DPD R0-R3 DFF                                                                 1'b0
                 set from 0 to 1 to change DPD_R0-R3, set from 1 to 0 to enable lock
    11:10    rw  output voltage of LDO_AUX_LQ VREF                                                          2'b10
    14:12    rw  LPBG VREF 1.2V fine tune                                                                   3'b100
    15       rw  enable HV33 domain DET (Note: useless currently)                                           1'b0
*/
typedef union _BTAON_FAST_RG2X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t DPD_R_0: 1;                   // 00
        uint16_t DPD_R_1: 1;                   // 01
        uint16_t DPD_R_2: 1;                   // 02
        uint16_t DPD_R_3: 1;                   // 03
        uint16_t DPD_R_4: 1;                   // 04
        uint16_t DPD_R_5: 1;                   // 05
        uint16_t DPD_R_6: 1;                   // 06
        uint16_t DPD_R_7: 1;                   // 07
        uint16_t DPD_R_8: 1;                   // 08
        uint16_t DPD_RCK: 1;                   // 09
        uint16_t VR_SEL_LDOAUXLQ: 2;           // 11:10
        uint16_t BG_VREF_tune: 3;              // 14:12
        uint16_t POE_DET: 1;                   // 15
    };
} BTAON_FAST_RG2X_MBIAS_TYPE;

/* 0x36 ( RG3X_MBIAS )
    01:00    rw  as defined in POWER_DET sheet                                                              2'b10
    03:02    rw  as defined in POWER_DET sheet                                                              2'b10
    05:04    rw  as defined in POWER_DET sheet                                                              2'b10
    07:06    rw  as defined in POWER_DET sheet                                                              2'b10
    09:08    rw  as defined in POWER_DET sheet                                                              2'b10
    11:10    rw  as defined in POWER_DET sheet                                                              2'b10
    13:12    rw  as defined in POWER_DET sheet                                                              2'b10
    15:14    rw  as defined in POWER_DET sheet                                                              2'b10
*/
typedef union _BTAON_FAST_RG3X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t SEL_VAUX_VR_L: 2;             // 01:00
        uint16_t SEL_VAUX_VR_H: 2;             // 03:02
        uint16_t SEL_HV_VR_L: 2;               // 05:04
        uint16_t SEL_HV_VR_H: 2;               // 07:06
        uint16_t SEL_VBAT_VR_L: 2;             // 09:08
        uint16_t SEL_VBAT_VR_H: 2;             // 11:10
        uint16_t SEL_ADPIN_VR_L: 2;            // 13:12
        uint16_t SEL_ADPIN_VR_H: 2;            // 15:14
    };
} BTAON_FAST_RG3X_MBIAS_TYPE;

/* 0x38 ( RG4X_MBIAS )
    01:00    rw  as defined in POWER_DET sheet                                                              2'b10
    03:02    rw  as defined in POWER_DET sheet                                                              2'b10
    05:04    rw  as defined in POWER_DET sheet                                                              2'b10
    07:06    rw  as defined in POWER_DET sheet                                                              2'b10
    09:08    rw  as defined in POWER_DET sheet                                                              2'b10
    11:10    rw  as defined in POWER_DET sheet                                                              2'b10
    13:12    rw  as defined in POWER_DET sheet                                                              2'b10
    15:14    rw  as defined in POWER_DET sheet                                                              2'b10
*/
typedef union _BTAON_FAST_RG4X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t SEL_VAUDIO_VR_L: 2;           // 01:00
        uint16_t SEL_VAUDIO_VR_H: 2;           // 03:02
        uint16_t SEL_VDDCORE_VR_L: 2;          // 05:04
        uint16_t SEL_VDDCORE_VR_H: 2;          // 07:06
        uint16_t SEL_DVDD_VR_L: 2;             // 09:08
        uint16_t SEL_DVDD_VR_H: 2;             // 11:10
        uint16_t SEL_HV33_VR_L: 2;             // 13:12
        uint16_t SEL_HV33_VR_H: 2;             // 15:14
    };
} BTAON_FAST_RG4X_MBIAS_TYPE;

/* 0x3a ( RG5X_MBIAS )
    00       rw  0: enable LDO_PA softstart of PowerMOS                                                     1'b0
                 1: disable LDO_PA softstart of PowerMOS
    01       rw  0: enable LDO533_HQ softstart of PowerMOS                                                  1'b0
                 1: disable LDO533_HQ softstart of PowerMOS
    02       rw  1: enable dummy load, 0: disable dummy load                                                1'b0
    03       rw  1: enable dummy load, 0: disable dummy load                                                1'b0
    05:04    rw  output voltage of LDO_RET VREF                                                             2'b10
    06       rw  0: enable dummy load, 1: disable dummy load (enable dummy load by default, set 1 for DLPS) 1'b0
    07       rw  0: enable dummy load, 1: disable dummy load (disable dummy load by default for DPD)        1'b1
    08       rw  0: enable dummy load, 1: disable dummy load (enable dummy load by default, set 1 for DLPS) 1'b0
    09       rw  0: enable dummy load, 1: disable dummy load (enable dummy load by default, set 1 for DLPS) 1'b0
    10       r                                                                                              1'b0
    11       r                                                                                              1'b0
    12       r                                                                                              1'b0
    13       r                                                                                              1'b0
    14       r                                                                                              1'b0
    15       r                                                                                              1'b0
*/
typedef union _BTAON_FAST_RG5X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ENB_LDO_PA_SS: 1;             // 00
        uint16_t ENB_LDO533_HQ_SS: 1;          // 01
        uint16_t EN_LDO_PA_DL: 1;              // 02
        uint16_t EN_LDO533_HQ_DL: 1;           // 03
        uint16_t VR_SEL_LDORET: 2;             // 05:04
        uint16_t ENB_LDO733_LQ_DL: 1;          // 06
        uint16_t ENB_LDO733DPD_DL: 1;          // 07
        uint16_t ENB_LDO318_DL: 1;             // 08
        uint16_t ENB_LDO311_DL: 1;             // 09
        uint16_t POW_VAUDIO_DET: 1;            // 10
        uint16_t POW_VDDCORE_DET: 1;           // 11
        uint16_t POW_VAUX_DET: 1;              // 12
        uint16_t POW_HV_DET: 1;                // 13
        uint16_t POW_VBAT_DET: 1;              // 14
        uint16_t POW_ADP_DET: 1;               // 15
    };
} BTAON_FAST_RG5X_MBIAS_TYPE;

/* 0x3c ( RG6X_MBIAS )
    02:00    rw  protected by lock                                                                          3'b110
    06:03    rw  output voltage of LDO318 (default 1.8V)                                                    4'b0100
    11:07    rw  output voltage of LDO311 (default 1.1V)                                                    5'b10000
    13:12    rw  as defined in POWER_DET sheet                                                              2'b10
    15:14    rw  as defined in POWER_DET sheet                                                              2'b10
*/
typedef union _BTAON_FAST_RG6X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LDO733DPD_TUNE: 3;            // 02:00
        uint16_t LDO318_TUNE: 4;               // 06:03
        uint16_t LDO311_TUNE: 5;               // 11:07
        uint16_t SEL_LDO733_LQ_2D5_VR_L: 2;    // 13:12
        uint16_t SEL_LDO733_LQ_2D5_VR_H: 2;    // 15:14
    };
} BTAON_FAST_RG6X_MBIAS_TYPE;

/* 0x3e ( RG7X_MBIAS )
    05:00    rw  output voltage of LDO_PA (default 3.3V)                                                    6'b110100
    07:06    rw  00:10uA, 01:20uA, 10:40uA, 11:80uA                                                         2'b10
    09:08    rw  00:10uA, 01:20uA, 10:40uA, 11:80uA                                                         2'b10
    15:10    r   output voltage of LDO533_HQ (default 3.3V)                                                 6'b110100
*/
typedef union _BTAON_FAST_RG7X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LDO_PA_TUNE: 6;               // 05:00
        uint16_t LDO_PA_DL: 2;                 // 07:06
        uint16_t LDO533_HQ_DL: 2;              // 09:08
        uint16_t LDO533_HQ_TUNE: 6;            // 15:10
    };
} BTAON_FAST_RG7X_MBIAS_TYPE;

/* 0x40 ( RG8X_MBIAS )
    02:00    rw  adjust thermal curve of BG                                                                 3'b100
    05:03    rw  adjust thermal curve of BG                                                                 3'b100
    07:06    rw  adjust voltage divider resistance of ADPIN                                                 2'b00
    09:08    rw  adjust MFB R                                                                               2'b11
    12:10    rw  adjust DPD ADPIN DET Vth                                                                   3'b010
    15:13    rw  adjust DPD ADPIN DET Vth                                                                   3'b010
*/
typedef union _BTAON_FAST_RG8X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t BG_R2_tune: 3;                // 02:00
        uint16_t BG_R1_tune: 3;                // 05:03
        uint16_t DPD_ADPIN_DR_L: 2;            // 07:06
        uint16_t DPD_TUNE_MFB: 2;              // 09:08
        uint16_t DPD_ADPIN_DET_L: 3;           // 12:10
        uint16_t DPD_ADPIN_DET_H: 3;           // 15:13
    };
} BTAON_FAST_RG8X_MBIAS_TYPE;

