wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x44 ( FLAG0X_MBIAS )
    00      r   Adapter Power detect                                                                        1'b0
    01      r   VBAT Power detect                                                                           1'b0
    02      r   HW_RST_N                                                                                    1'b0
    03      r   HV Power on reset(5V Power detect)                                                          1'b0
    04      r   LDO_AUX Power on reset                                                                      1'b0
    05      r   Force power on reset low; PMU weakly pull low for digital                                   1'b0
    06      r   LDO_HV33_LQ 2.5V Power on reset                                                             1'b0
    07      r   LDO_HV33_LQ Power on reset                                                                  1'b0
    08      r   LDO311 Power on reset                                                                       1'b0
    09      r   Bandgap OK                                                                                  1'b0
    10      r   VAUDIO(AVCCDRV) Power detect                                                                1'b0
    11      r   VDDCORE Power detect                                                                        1'b0
    12      r   LDO733DPD Power detect                                                                      1'b0
    13      r   MFB Power detect                                                                            1'b0
    14      r   VBAT Power detect in DPD                                                                    1'b0
    15      r   ADPIN Power detect in DPD                                                                   1'b0
*/
typedef union _BTAON_FAST_FLAG0X_MBIAS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ADP_DET_L: 1;                 // 00
        uint16_t VBAT_DET_L: 1;                // 01
        uint16_t HW_RST_N: 1;                  // 02
        uint16_t HV_DET_L: 1;                  // 03
        uint16_t VAUX_DET_L: 1;                // 04
        uint16_t FPOR_L: 1;                    // 05
        uint16_t LDD733_LQ_2D5_DET_L: 1;       // 06
        uint16_t LDO733_LQ_DET_L: 1;           // 07
        uint16_t DVDD_DET_L: 1;                // 08
        uint16_t BGOK_L: 1;                    // 09
        uint16_t VAUDIO_DET_L: 1;              // 10
        uint16_t VDDCORE_DET_L: 1;             // 11
        uint16_t LDO733DPD_DET_L: 1;           // 12
        uint16_t MFB1_DET_L: 1;                // 13
        uint16_t VBAT_DPD_DET_L: 1;            // 14
        uint16_t ADPIN_DPD_DET_L: 1;           // 15
    };
} BTAON_FAST_FLAG0X_MBIAS_TYPE;

/* 0x46 ( RG0X_CHG )
    00       r   POW M2                                                                                     1'b0
    01       r   POW M1                                                                                     1'b0
    03:02    rw                                                                                             2'b11
    04       rw  OP offset K mode                                                                           1'b0
    09:05    rw  M2 CC current sense offset K code                                                          5'b10000
                 Trim range:~ -19mV to +15mV
    10       r   enable dvdet_M2 (compare HV and VBAT)                                                      1'b0
    11       r   enable dvdet_M1 (compare ADP and VBAT)                                                     1'b0
    12       rw  Current sense offset K mode                                                                1'b0
    13       rw  enable M2 VC disable bias                                                                  1'b1
    14       rw  enable M1 VC disable bias                                                                  1'b1
    15       rw                                                                                             1'b0
*/
typedef union _BTAON_FAST_RG0X_CHG_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_M2: 1;                    // 00
        uint16_t POW_M1: 1;                    // 01
        uint16_t CHG_dummy0: 2;                // 03:02
        uint16_t KMODOP: 1;                    // 04
        uint16_t CSOFSKM2: 5;                  // 09:05
        uint16_t POW_DVDET_M2: 1;              // 10
        uint16_t POW_DVDET_M1: 1;              // 11
        uint16_t KMODCS: 1;                    // 12
        uint16_t ENDISBIAS_M2: 1;              // 13
        uint16_t ENDISBIAS_M1: 1;              // 14
        uint16_t CHG_dummy1: 1;                // 15
    };
} BTAON_FAST_RG0X_CHG_TYPE;

/* 0x48 ( RG1X_CHG )
    06:00    rw  M2 CV Gain error K,Trim range: +/-20%, 1lsb=~0.3%                                          7'b1000000
    11:07    rw  M2 CV Select, Vout=3.7+0.025*M2CVSEL, Detail in CHG_table                                  5'b10100
    15:12    rw  M1 CV Select, Vout= 3.72+0.12*M1CVSEL, Detail in CHG_table                                 4'b1011
*/
typedef union _BTAON_FAST_RG1X_CHG_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t M2CVK: 7;                     // 06:00
        uint16_t M2CVSEL: 5;                   // 11:07
        uint16_t M1CVSEL: 4;                   // 15:12
    };
} BTAON_FAST_RG1X_CHG_TYPE;

/* 0x4a ( RG2X_CHG )
    00       rw  1: Enable BAT short detector                                                               1'b0
    01       rw  1: M2 fully on 1K mode                                                                     1'b0
    03:02    rw  M2 discharge CC Select, 00: SD, 01: 50mA, 10: 100mA, 11: 500mA                             2'b11
    07:04    rw  M2 CC Select, Detail in CHG_table                                                          4'b0000
    09:08    rw  M2 CC FB select, 00: SD, 01: 25X, 10: 5X, 11: 1X, Detail in CHG_table                      2'b00
    13:10    rw  M1 CC Select, Detail in CHG_table                                                          4'b0010
    15:14    rw  M1 CC FB select, 00: SD, 01: 25X, 10: 5X, 11: 1X, Detail in CHG_table                      2'b11
*/
typedef union _BTAON_FAST_RG2X_CHG_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ENBATSHORTDET: 1;             // 00
        uint16_t M2FON1K: 1;                   // 01
        uint16_t M2CCDFBSEL: 2;                // 03:02
        uint16_t M2CCSEL: 4;                   // 07:04
        uint16_t M2CCFBSEL: 2;                 // 09:08
        uint16_t M1CCSEL: 4;                   // 13:10
        uint16_t M1CCFBSEL: 2;                 // 15:14
    };
} BTAON_FAST_RG2X_CHG_TYPE;

/* 0x4c ( RG3X_CHG )
    04:00   rw  M2 CC EA Offset K,Trim target: offset < 1mV                                                 5'b10000
    09:05   rw  M2 CV EA Offset K, Trim target: offset < 1mV                                                5'b10000
    15:10   rw  M2 CC Gain error K, Trim range: +/-34%, 1lsb=~1.06%                                         6'b100000
*/
typedef union _BTAON_FAST_RG3X_CHG_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t M2CCOPOFS: 5;                 // 04:00
        uint16_t M2CVOPOFS: 5;                 // 09:05
        uint16_t M2CCK: 6;                     // 15:10
    };
} BTAON_FAST_RG3X_CHG_TYPE;

/* 0x4e ( FLAG0X_CHG )
    02:00    r                                                                                              1'b0
    03       r                                                                                              1'b0
    04       r                                                                                              1'b0
    05       r                                                                                              1'b0
    06       r                                                                                              1'b0
    07       r                                                                                              1'b0
*/
typedef union _BTAON_FAST_FLAG0X_CHG_TYPE
{
    uint8_t d8;
    struct
    {
        uint8_t CHG_dummy: 3;                  // 00
        uint8_t M2CSOPK_FLG: 1;                // 03
        uint8_t M2CCOPK_FLG: 1;                // 04
        uint8_t M2CVOPK_FLG: 1;                // 05
        uint8_t BATSUP: 1;                     // 06
        uint8_t ADPHIBAT: 1;                   // 07
    };
} BTAON_FAST_FLAG0X_CHG_TYPE;

/* 0x78 ( RG1X_SWR_AUDIO )
    00      rw  1: ENABLE HV SW(if EN SWR AUDIO)                                                            1'b0
    04:01   rw  tune PFM VOUT voltage ,PFM_AUDIO                                                            4'b0111
                VR<564>=2.825V to VR<494>=2.48V, VR<10>=50mV/step
                VR<444>=2.225V to VR<374>=1.875V, VR<10>=50mV/step
    07:05   rw  For PWM (no use)                                                                            3'b100
    08      rw  1: PWM_VREF Softstart, 0: PWM_VREF=0.48V                                                    1'b1
    11:09   rw  VR<134>,VR<124>,VR<114>,VR<104>,VR<29>,VR<19>,VR<9>,0"                                      3'b100
    12      rw  0:LX Reset 1:PGATE Reset                                                                    1'b1
    13      rw                                                                                              1'b1
    14      rw                                                                                              1'b1
    15      rw                                                                                              1'b1
*/
typedef union _BTAON_FAST_RG1X_SWR_AUDIO_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_HV_SW: 1;                 // 00
        uint16_t VREFPFM_H: 4;                 // 04:01
        uint16_t VREFOCP_H: 3;                 // 07:05
        uint16_t ENVREFSS_H: 1;                // 08
        uint16_t VREFOCP_PFM: 3;               // 11:09
        uint16_t ZCDRSNEWB: 1;                 // 12
        uint16_t ENZCDPFMPS_H: 1;              // 13
        uint16_t ENZCDPFM_H: 1;                // 14
        uint16_t ENZCDPWMPS_H: 1;              // 15
    };
} BTAON_FAST_RG1X_SWR_AUDIO_TYPE;

/* 0x86 ( RG4X_SWR_AUDIO )
    02:00   rw  tune PMOS feedback delay                                                                    3'b100
    09:03   rw  <9>:dummy <8:3>: 000000=3.21V                                                               7'b0101111
                                 000001=3.18V
                                 000010=3.15V
                                 ??
                                 101111=1.8V
                                 ??
                                 111111=1.32V
    10      rw  1: SWR OFF, PWDN Current = 10uA, 0: PWDN Current = 10nA                                     1'b0
    11      rw  1: enable bypass REFOK 0: disable bypass REFOK                                              1'b0
    12      rw  1: enable PFMCOT 0:disable PFMCOT                                                           1'b1
    15:13   rw  off time of pfm                                                                             3'b100
*/
typedef union _BTAON_FAST_RG4X_SWR_AUDIO_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t SWRAUD_SDZP_H: 3;             // 02:00
        uint16_t VOUT_TUNE_H: 7;               // 09:03
        uint16_t EN_POWDN_CURRENT: 1;          // 10
        uint16_t BYPASS_REFOK: 1;              // 11
        uint16_t PFM_COT_EN: 1;                // 12
        uint16_t OFFT_H: 3;                    // 15:13
    };
} BTAON_FAST_RG4X_SWR_AUDIO_TYPE;

/* 0x90 ( RG0X_LDO1 )
    00       rw  1: power on LDO_AUX_HQ, 0: power off LDO_AUX_HQ                                            1'b0
    01       rw  1: power on LDO_AUX_HQ VREF, 0: power off LDO_AUX_HQ VREF                                  1'b0
    04:02    rw  REF = 62.5mV * REG<2:0> (REG<2:0> = 111, REF = 500mV)                                      3'b000
    05       rw  1: enable dummy load, 0: disable dummy load                                                1'b0
    06       rw  0: enable LDO_AUX_HQ softstart of POWER MOS softstart                                      1'b0
                 1: disable LDO_AUX_HQ softstart of POWER MOS softstart
    12:07    rw  output voltage of AUX_HQ (default 1.8V)                                                    6'b001110
    13       rw  1: enable LDO_AUX_LQ driving                                                               1'b0
    14       rw  1: enable LDO_AUDIO_LQ driving                                                             1'b0
    15       rw                                                                                             1'b0
*/
typedef union _BTAON_FAST_RG0X_LDO1_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_LDO_AUX_HQ: 1;            // 00
        uint16_t POW_LDO_AUX_HQ_VREF: 1;       // 01
        uint16_t VR_SEL_LDO_AUX_HQ: 3;         // 04:02
        uint16_t EN_LDO_AUX_HQ_DL: 1;          // 05
        uint16_t ENB_LDO_AUX_HQ_SS: 1;         // 06
        uint16_t LDO_AUX_HQ_TUNE: 6;           // 12:07
        uint16_t EN_LDO_AUX_LQ_DRV: 1;         // 13
        uint16_t EN_LDO_AUDIO_LQ_DRV: 1;       // 14
        uint16_t LDO1_dummy: 1;                // 15
    };
} BTAON_FAST_RG0X_LDO1_TYPE;

