wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x92 ( RG1X_LDO1 )
    00       rw  1: power on LDO_AUX_LQ, 0: power off LDO_AUX_LQ                                            1'b0
    01       rw  0: enable dummy load, 1: disable dummy load (enable dummy load by default, set 1 for DLPS) 1'b0
    07:02    rw  output voltage of AUX_LQ (default 1.7V)                                                    6'b001100
    08       rw  1: power on LDO_AUDIO_LQ, 0: power off LDO_AUDIO_LQ                                        1'b0
    09       rw  0: enable dummy load, 1: disable dummy load (enable dummy load by default, set 1 for DLPS) 1'b0
    10       rw                                                                                             1'b0
    15:11    rw  output voltage of AUDIO_LQ (default 1.8V)                                                  5'b00100
*/
typedef union _BTAON_FAST_RG1X_LDO1_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_LDO_AUX_LQ: 1;            // 00
        uint16_t ENB_LDO_AUX_LQ_DL: 1;         // 01
        uint16_t LDO_AUX_LQ_TUNE: 6;           // 07:02
        uint16_t POW_LDO_AUDIO_LQ: 1;          // 08
        uint16_t ENB_LDO_AUDIO_LQ_DL: 1;       // 09
        uint16_t LDO1_dummy: 1;                // 10
        uint16_t LDO_AUDIO_LQ_TUNE: 5;         // 15:11
    };
} BTAON_FAST_RG1X_LDO1_TYPE;

/* 0x94 ( RG2X_LDO1 )
    00       rw  0: VOUT_AVCC_DRV floating, 1: VOUT_AVCC_DRV = VOUT_AUDIO_LQ                                1'b0
    01       rw  0: VOUT_AVCC floating, 1: VOUT_AVCC = VOUT_AUDIO_LQ                                        1'b0
    03:02    rw  00:10uA, 01:20uA, 10:40uA, 11:80uA                                                         2'b00
    06:04    rw                                                                                             3'b000
    07       rw  control AUX Power Cut PAD  (VG2 is larger Power Cut PMOS)                                  1'b1
    08       rw  control AUX Power Cut PAD  (VG1 is smaller Power Cut PMOS)                                 1'b1
    09       rw  control AUX Power Cut PAD                                                                  1'b1
    15:10    rw                                                                                             6'b000000
*/
typedef union _BTAON_FAST_RG2X_LDO1_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t VOUT_AVCC_DRV: 1;             // 00
        uint16_t VOUT_AVCC: 1;                 // 01
        uint16_t LDO_AUX_HQ_DL: 2;             // 03:02
        uint16_t LDO1_dummy1: 3;               // 06:04
        uint16_t PCUT_AUX_VG2_33: 1;           // 07
        uint16_t PCUT_AUX_VG1_33: 1;           // 08
        uint16_t PCUT_AUX_ESDCTRL: 1;          // 09
        uint16_t LDO1_dummy0: 6;               // 15:10
    };
} BTAON_FAST_RG2X_LDO1_TYPE;

/* 0xa4
    00       rw  1: power on LDO PA, 0: power off                                                           1'b0
    01       r   1: power on LDO PA, 0: power off                                                           1'b0
    15:02    rw  dummy
*/
typedef union _BTAON_FAST_0xA4_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LDO_POW_LDO_PA_src: 1;        // 00
        uint16_t LDO_POW_LDO_PA: 1;            // 01
        uint16_t LDO_rsvd: 14;                 // 15:02
    };
} BTAON_FAST_0xA4_TYPE;

/* 0xa8
    02:00    rw  0: 16Mhz, 1: 24Mhz, 2: 26Mhz, 3: 32Mhz, 4: 38.4Mhz, 5: 40Mhz                               3'b5
    03       rw  0: from AON, 1: from core domain                                                           1'b0
    09:04    rw  AAC_GM value to XTAL. valid if AAC_SEL = 0, for RF mode                                    6'h1f
    15:10    rw  AAC_GM value to XTAL. valid if AAC_SEL = 0, for IDLE mode                                  6'h1f
*/
typedef union _BTAON_FAST_RG3X_LDO2_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t XTAL_FREQ_SEL: 3;             // 02:00
        uint16_t AAC_SEL: 1;                   // 03
        uint16_t AAC_GM1: 6;                   // 09:04
        uint16_t AAC_GM: 6;                    // 15:10
    };
} BTAON_FAST_RG3X_LDO2_TYPE;

/* 0xaa
    00       rw                                                                                             1'b0
    01       rw                                                                                             1'b0
    02       rw  ADDA_POW_LDO_OP    110: LDO mode, 001: power cut mode. 000: off                            1'b0
    03       rw                                                                                             1'b0
    06:04    rw  000:0.90 001:0.95 010:1.00 011:1.05 100:1.10 101:1.15 110:1.20                             3'b010
    07       rw                                                                                             1'b0
    08       rw                                                                                             1'b0
    09       rw  Power cut USB1.1                                                                           1'b0
    10       rw  Power cut BC1.2                                                                            1'b0
    11       rw  Power on the OP in the LDO                                                                 1'b0
    12       rw  Power on mbias                                                                             1'b0
    13       rw  Power on BC1.2                                                                             1'b0
    14       rw  Isolation APHY to DPHY signal                                                              1'b1
    15       rw  0: from AON, 1: from core domain                                                           1'b0
*/
typedef union _BTAON_FAST_0xAA_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ADDA_SW_LDO2PWRCUT: 1;        // 00
        uint16_t ADDA_POW_LDO_VREF: 1;         // 01
        uint16_t ADDA_POW_LDO_OP: 1;           // 02
        uint16_t ADDA_LDO_VPULSE: 1;           // 03
        uint16_t ADDA_LDO_SW: 3;               // 06:04
        uint16_t ADDA_DOUBLE_OP_I: 1;          // 07
        uint16_t rsvd: 1;                      // 08
        uint16_t U11_POW_BC_V33: 1;            // 09
        uint16_t U11_POW_USB_V33: 1;           // 10
        uint16_t U11_en_pc_mode: 1;            // 11
        uint16_t U11_POW_BG: 1;                // 12
        uint16_t U11_POW_BC_L: 1;              // 13
        uint16_t ISO_UA2USB: 1;                // 14
        uint16_t RCAL_32K_SEL: 1;              // 15
    };
} BTAON_FAST_0xAA_TYPE;

/* 0xac
    00       r                                                                                              1'b0
    01       r                                                                                              1'b0
    02       r   110: LDO mode, 001: power cut mode. 000: off                                               1'b0
    03       rw                                                                                             1'b0
    06:04    rw  000:0.90 001:0.95 010:1.00 011:1.05 100:1.10 101:1.15 110:1.20                             3'b010
    07       rw                                                                                             1'b0
    08       rw  CPU 1st stage CKMUX0 select, 0x0 : clock from xtal, 0x1 : clock from FNPLL                 1'b0
    09       rw  CPU 2ed stage CKMUX1 select, 0x0 : clock from OSC40, 0x1 : clock from CKMUX0 out           1'b0
    15:10    rw
*/
typedef union _BTAON_FAST_0xAC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t PLL_SW_LDO2PWRCUT: 1;         // 00
        uint16_t PLL_POW_LDO_VREF: 1;          // 01
        uint16_t PLL_POW_LDO_OP: 1;            // 02
        uint16_t PLL_LDO_VPULSE: 1;            // 03
        uint16_t PLL_LDO_SW: 3;                // 06:04
        uint16_t PLL_DOUBLE_OP_I: 1;           // 07
        uint16_t cpu_clk_src_sel_0: 1;         // 08
        uint16_t cpu_clk_src_sel_1: 1;         // 09
        uint16_t rsvd: 6;                      // 15:10
    };
} BTAON_FAST_0xAC_TYPE;

/* 0xd0 ( RG11X_MBIAS )
    00      rw  power on seq POW_VAUX_DET reg setting                                                       1'b1
    01      rw  power on seq POW_VDDCORE_DET reg setting                                                    1'b1
    02      rw  power on seq POW_HV_DET reg setting                                                         1'b1
    03      rw  power on seq POW_VBAT_DET reg setting                                                       1'b1
    04      rw  power on seq POW_ADP_DET reg setting                                                        1'b1
    05      rw  power on seq POW_BIAS reg setting                                                           1'b1
    06      rw  power on seq POW_LDO_PA reg setting                                                         1'b0
    07      rw
    08      rw  power on seq POW_LDO533 reg setting                                                         1'b1
    09      rw  power on seq POW_LDO_VREF reg setting                                                       1'b1
    10      rw  power on seq POW_LDODIG_PC reg setting                                                      1'b0
    11      rw  power on seq POW_LDODIG reg setting                                                         1'b1
    12      rw  power on seq POW_VCORE_PC reg setting                                                       1'b0
    13      rw  power on seq POW_LDO_VCORE reg setting                                                      1'b1
    14      rw  power on seq POW_LDO_RET reg setting                                                        1'b0
    15      rw  power on seq POW_LDO318 reg setting                                                         1'b1
*/
typedef union _BTAON_FAST_0xD0_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_POW_VAUX_DET: 1;      // 00
        uint16_t LOP_PON_POW_VDDCORE_DET: 1;   // 01
        uint16_t LOP_PON_POW_HV_DET: 1;        // 02
        uint16_t LOP_PON_POW_VBAT_DET: 1;      // 03
        uint16_t LOP_PON_POW_ADP_DET: 1;       // 04
        uint16_t LOP_PON_POW_BIAS: 1;          // 05
        uint16_t LOP_PON_POW_LDO_PA: 1;        // 06
        uint16_t LOP_rsvd: 1;                  // 07
        uint16_t LOP_PON_POW_LDO533: 1;        // 08
        uint16_t LOP_PON_POW_LDO_VREF: 1;      // 09
        uint16_t LOP_PON_POW_LDODIG_PC: 1;     // 10
        uint16_t LOP_PON_POW_LDODIG: 1;        // 11
        uint16_t LOP_PON_POW_VCORE_PC: 1;      // 12
        uint16_t LOP_PON_POW_LDO_AUX_HQ: 1;    // 13
        uint16_t LOP_PON_POW_LDO_RET: 1;       // 14
        uint16_t LOP_PON_POW_LDO318: 1;        // 15
    };
} BTAON_FAST_0xD0_TYPE;

/* 0xd2 ( RG11X_MBIAS )
    00      rw  power on seq POW_DVDET_M2 reg setting                                                       1'b1
    01      rw  power on seq POW_DVDET_M1 reg setting                                                       1'b1
    02      rw  power on seq POW_SWRCORE_HV_SW reg setting                                                  1'b0
    03      rw  power on seq POW_LDODIG_VREF reg setting                                                    1'b0
    06:04   rw
    07      rw  power on seq SWR mode reg setting                                                           1'b0
    08      rw  power on seq LDO mode reg setting                                                           1'b1
    09      rw  power on seq PFM mode reg setting                                                           1'b0
    10      rw  power on seq POW_POW_32KXTAL reg setting                                                    1'b0
    11      rw  power on seq POW_POW_32KOSC reg setting                                                     1'b1
    12      rw  power on seq POW_LDO_AUX_VREF reg setting                                                   1'b1
    13      rw  power on seq POW_VAUDIO_DET reg setting                                                     1'b1
    14      rw  power on seq POW_M2 reg setting                                                             1'b1
    15      rw  power on seq POW_M1 reg setting                                                             1'b1
*/
typedef union _BTAON_FAST_0xD2_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_POW_DVDET_M2: 1;      // 00
        uint16_t LOP_PON_POW_DVDET_M1: 1;      // 01
        uint16_t LOP_PON_SWRCORE_POW_HV_SW: 1; // 02
        uint16_t LOP_PON_POW_LDODIG_VREF: 1;   // 03
        uint16_t LOP_PON_rsvd: 3;              // 06:04
        uint16_t LOP_PON_ENSWR_AONH: 1;        // 07
        uint16_t LOP_PON_ENLDO_AONH: 1;        // 08
        uint16_t LOP_PON_PFM: 1;               // 09
        uint16_t LOP_PON_POW_32KXTAL: 1;       // 10
        uint16_t LOP_PON_POW_32KOSC: 1;        // 11
        uint16_t LOP_PON_POW_LDO_AUX_VREF: 1;  // 12
        uint16_t LOP_PON_POW_VAUDIO_DET: 1;    // 13
        uint16_t LOP_PON_POW_M2: 1;            // 14
        uint16_t LOP_PON_POW_M1: 1;            // 15
    };
} BTAON_FAST_0xD2_TYPE;

/* 0xd4 ( RG11X_MBIAS )
    00      rw  power off seq POW_VAUX_DET reg setting                                                      1'b1
    01      rw  power off seq POW_VDDCORE_DET reg setting                                                   1'b1
    02      rw  power off seq POW_HV_DET reg setting                                                        1'b1
    03      rw  power off seq POW_VBAT_DET reg setting                                                      1'b1
    04      rw  power off seq POW_ADP_DET reg setting                                                       1'b1
    05      rw  power off seq POW_BIAS reg setting                                                          1'b0
    06      rw  power off seq POW_LDO_PA reg setting                                                        1'b0
    07      rw
    08      rw  power off seq POW_LDO533 reg setting                                                        1'b0
    09      rw  power off seq POW_LDO_VREF reg setting                                                      1'b0
    10      rw  power off seq POW_LDODIG_PC reg setting                                                     1'b0
    11      rw  power off seq POW_LDODIG reg setting                                                        1'b0
    12      rw  power off seq POW_VCORE_PC reg setting                                                      1'b0
    13      rw  power off seq POW_LDO_AUX_HQ reg setting                                                    1'b0
    14      rw  power off seq POW_LDO_RET reg setting                                                       1'b0
    15      rw  power off seq POW_LDO318 reg setting                                                        1'b0
*/
typedef union _BTAON_FAST_0xD4_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_POW_VAUX_DET: 1;      // 00
        uint16_t LOP_POF_POW_VDDCORE_DET: 1;   // 01
        uint16_t LOP_POF_POW_HV_DET: 1;        // 02
        uint16_t LOP_POF_POW_VBAT_DET: 1;      // 03
        uint16_t LOP_POF_POW_ADP_DET: 1;       // 04
        uint16_t LOP_POF_POW_BIAS: 1;          // 05
        uint16_t LOP_POF_POW_LDO_PA: 1;        // 06
        uint16_t LOP_rsvd: 1;                  // 07
        uint16_t LOP_POF_POW_LDO533: 1;        // 08
        uint16_t LOP_POF_POW_LDO_VREF: 1;      // 09
        uint16_t LOP_POF_POW_LDODIG_PC: 1;     // 10
        uint16_t LOP_POF_POW_LDODIG: 1;        // 11
        uint16_t LOP_POF_POW_VCORE_PC: 1;      // 12
        uint16_t LOP_POF_POW_LDO_AUX_HQ: 1;    // 13
        uint16_t LOP_POF_POW_LDO_RET: 1;       // 14
        uint16_t LOP_POF_POW_LDO318: 1;        // 15
    };
} BTAON_FAST_0xD4_TYPE;

/* 0xd6 ( RG11X_MBIAS )
    00      rw  power off seq POW_DVDET_M2 reg setting                                                      1'b0
    01      rw  power off seq POW_DVDET_M1 reg setting                                                      1'b0
    02      rw  power off seq POW_SWRCORE_HV_SW reg setting                                                 1'b0
    03      rw  power off seq POW_LDODIG_VREF reg setting                                                   1'b0
    07      rw  power off seq SWR mode reg setting                                                          1'b0
    08      rw  power off seq LDO mode reg setting                                                          1'b0
    09      rw  power off seq PFM mode reg setting                                                          1'b0
    10      rw  power off seq POW_POW_32KXTAL reg setting                                                   1'b0
    11      rw  power off seq POW_POW_32KOSC reg setting                                                    1'b1
    12      rw  power on seq POW_LDO_AUX_VREF reg setting                                                   1'b1
    13      rw  power off seq POW_VAUDIO_DET reg setting                                                    1'b1
    14      rw  power off seq POW_M2 reg setting                                                            1'b0
    15      rw  power off seq POW_M1 reg setting                                                            1'b0
*/
typedef union _BTAON_FAST_0xD6_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_POW_DVDET_M2: 1;      // 00
        uint16_t LOP_POF_POW_DVDET_M1: 1;      // 01
        uint16_t LOP_POF_SWRCORE_POW_HV_SW: 1; // 02
        uint16_t LOP_POF_POW_LDODIG_VREF: 1;   // 03
        uint16_t LOP_POF_rsvd: 3;              // 06:04
        uint16_t LOP_POF_ENSWR_AONH: 1;        // 07
        uint16_t LOP_POF_ENLDO_AONH: 1;        // 08
        uint16_t LOP_POF_PFM: 1;               // 09
        uint16_t LOP_POF_POW_32KXTAL: 1;       // 10
        uint16_t LOP_POF_POW_32KOSC: 1;        // 11
        uint16_t LOP_POF_POW_LDO_AUX_VREF: 1;  // 12
        uint16_t LOP_POF_POW_VAUDIO_DET: 1;    // 13
        uint16_t LOP_POF_POW_M2: 1;            // 14
        uint16_t LOP_POF_POW_M1: 1;            // 15
    };
} BTAON_FAST_0xD6_TYPE;

/* 0xd8 ( RG11X_MBIAS )
    07:00   rw  M1M2 delay if FW_PMU_SEQ is 1.                         unit : 32k period * 2                8'h30
    15:08   rw  Power on BIAS delay setting, if FW_PMU_SEQ is set 1.                                        8'h30
                all SWR/LDO delay if FW_PMU_SEQ is set 0.              unit : 32k period * 2
*/
typedef union _BTAON_FAST_0xD8_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_M1M2_delay: 8;        // 07:00
        uint16_t LOP_PON_BIAS_delay: 8;        // 15:08
    };
} BTAON_FAST_0xD8_TYPE;

/* 0xda ( RG11X_MBIAS )
    07:00   rw  VDDCORE delay if FW_PMU_SEQ is 1.                      unit : 32k period * 2                8'h30
    15:08   rw  VCORE/VPON delay if FW_PMU_SEQ is 1.                   unit : 32k period * 2                8'h30
*/
typedef union _BTAON_FAST_0xDA_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_SWR_delay: 8;         // 07:00
        uint16_t LOP_PON_LDO_delay: 8;         // 15:08
    };
} BTAON_FAST_0xDA_TYPE;

