wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0xdc ( RG11X_MBIAS )
    06:00   rw  MSB=0, 0.68+(0.01*i) --> default Vout=1 --> 0100000 MSB=1, 1.02+0.015*i                     7'b0010000
    07      rw
    12:08   rw                                                                                              5'b01100
    13
    15:14   rw                                                                                              2'b00
*/
typedef union _BTAON_FAST_0xDC_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_VOUT_TUNE_H: 7;       // 06:00
        uint16_t LOP_rsvd0: 1;                 // 07
        uint16_t LOP_PON_VREFPFM_H: 5;         // 12:08
        uint16_t LOP_rsvd1: 1;                 // 13
        uint16_t LOP_PON_FPWMCTL_H: 2;         // 15:14
    };
} BTAON_FAST_0xDC_TYPE;

/* 0xde ( RG11X_MBIAS )
    04:00   rw  output voltage of LDODIG, default 1.1V                                                      5'b10110
    07:05   rw
    15:08   rw  default: 3 ms                                                                               8'h30
*/
typedef union _BTAON_FAST_0xDE_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_LDO_DIG_TUNE: 5;      // 04:00
        uint16_t rsvd: 3;                      // 07:05
        uint16_t LOP_PON_AUX_HQ_delay: 8;      // 15:08
    };
} BTAON_FAST_0xDE_TYPE;

/* 0xe0 ( RG11X_MBIAS )
    06:00   rw  MSB=0, 0.68+(0.01*i) --> default Vout=1 --> 0100000 MSB=1, 1.02+0.015*i                     7'b0010000
    07      rw
    12:08   rw                                                                                              5'b01100
    13
    15:14   rw                                                                                              2'b00
*/
typedef union _BTAON_FAST_0xE0_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_VOUT_TUNE_H: 7;       // 06:00
        uint16_t LOP_rsvd0: 1;                 // 07
        uint16_t LOP_POF_VREFPFM_H: 5;         // 12:08
        uint16_t LOP_rsvd1: 1;                 // 13
        uint16_t LOP_POF_FPWMCTL_H: 2;         // 15:14
    };
} BTAON_FAST_0xE0_TYPE;

/* 0xe2 ( RG11X_MBIAS )
    04:00   rw  output voltage of LDODIG, default 1.1V                                                      5'b10110
    05      rw  POW_BIAS for USB/PLL/CODEC/AUXADC                                                           1'b1
    15:06   rw
*/
typedef union _BTAON_FAST_0xE2_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_LDO_DIG_TUNE: 5;      // 04:00
        uint16_t LOP_POF_POW_BIAS_IP: 1;       // 05
        uint16_t rsvd: 10;                     // 15:06
    };
} BTAON_FAST_0xE2_TYPE;

/* 0xe4 ( RG11X_MBIAS )
    00      rw  0:gated the AON clock as in low power state.                                                1'b0
    01      rw  1:turn on xtal when power off.                                                              1'b0
    02      rw  1:turn on PLL when power on. 0:turn on osc40 when power on                                  1'b0
    03      rw  PLL power source LDO/PC mode. 0:LDO. 1:power cut mode                                       1'b0
    04      rw  1:bypass PLL and xtal clock directly output.                                                1'b0
    05      rw  bluewiz wakeup BTAON enable.                                                                1'b0
    07:06   rw
    15:08   rw  XTAL or OSC40 settling time                                                                 8'h30
*/
typedef union _BTAON_FAST_0xE4_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_AON_GATED_EN: 1;      // 00
        uint16_t LOP_POF_XTAL: 1;              // 01
        uint16_t LOP_PON_PLL: 1;               // 02
        uint16_t LOP_PON_PLL_TYPE: 1;          // 03
        uint16_t LOP_PON_BP_PLL: 1;            // 04
        uint16_t LOP_LPS_TIMER_WAKEUP: 1;      // 05
        uint16_t rsvd0: 2;                     // 07:06
        uint16_t LOP_PON_XTAL_delay: 8;        // 15:08
    };
} BTAON_FAST_0xE4_TYPE;

/* 0xe6 ( RG11X_MBIAS )
    07:00   rw  PLL settling time.                                                                          8'h30
    15:08   rw
*/
typedef union _BTAON_FAST_0xE6_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_PON_PLL_delay: 8;         // 07:00
        uint16_t rsvd0: 8;                     // 15:08
    };
} BTAON_FAST_0xE6_TYPE;

/* 0xe8 ( RG11X_MBIAS )
    05:00   rw
    07:06   rw  00: Normal mode     XTAL_LPMODE=0, TCXO_MODE=0                                              2'b00
                01: Low power mode  XTAL_LPMODE=1, TCXO_MODE=0
                10: buffer mode     XTAL_LPMODE=0, TCXO_MODE=1
    09:08   rw  00: Normal mode     XTAL_LPMODE=0, TCXO_MODE=0                                              2'b00
                01: Low power mode  XTAL_LPMODE=1, TCXO_MODE=0
                10: buffer mode     XTAL_LPMODE=0, TCXO_MODE=1
    10      rw  1: Retent the MODEM data path Retention FF when power state from Power down to active       1'b0
    11      rw  1: Retent the Platform Retention FF when power state from Power down to active              1'b0
    12      rw  1: Retent the BLE Retention FF when power state from Power down to active                   1'b0
    13      rw  1: Retent the Bluewiz Retention FF when power state from Power down to active               1'b0
    14      rw  1: Retent the MODEM Retention FF when power state from Power down to active                 1'b0
    15      rw  1: Retent the RFC Retention FF when power state from Power down to active                   1'b0
*/
typedef union _BTAON_FAST_0xE8_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t rsvd: 6;                      // 05:00
        uint16_t LOP_POF_XTAL_MODE: 2;         // 07:06
        uint16_t LOP_PON_XTAL_MODE: 2;         // 09:08
        uint16_t LOP_DP_MODEM_RET: 1;          // 10
        uint16_t LOP_PF_RET: 1;                // 11
        uint16_t LOP_BLE_RET: 1;               // 12
        uint16_t LOP_BZ_RET: 1;                // 13
        uint16_t LOP_MODEM_RET: 1;             // 14
        uint16_t LOP_RFC_RET: 1;               // 15
    };
} BTAON_FAST_0xE8_TYPE;

/* 0xf4 ( RG11X_MBIAS )
    00      rw  clock select 32K XTAL for AON                                                               1'b0
    01      rw  clock select 32K from LP XTAL for AON                                                       1'b0
    02      rw  1: enable clock gating as brown detected                                                    1'b0
    03      rw  1: enable core and pon domain reset as brown out detected.                                  1'b0
    04      rw  1: WAIT HV_DET in PON_M1M2 state. 0: only wait timeout in                                   1'b1
    05      rw  1: enable VIO2 detection reset the system.                                                  1'b1
    06      rw  1: enable VIO1 detection reset the system.                                                  1'b1
    07      rw  1: SWR controlled by core domain. 0: SWR controlled by AON.                                 1'b0
                VREFPFM, VREFOCP, OCPRSTSEL, OCPSEL, EHDP, EHDN, MPSZ, MNSZ. SAW_FREQ, VOUT_TUNE_H
    08      rw  disable brown out no wakeup function.                                                       1'b1
                1: disable. 0: as brown out occur, do not wakeup from LPS.
    09      rw  enable PMU sequently 0: turn on all the Power simultaneously                                1'b1
    10      rw
    15:11   rw  debug port selection valid when aon selected to aon and AON_DBG_SEL[4] = 1.                 5'b0
                output to {P1[7:0],AUXADC[7:0]}
*/
typedef union _BTAON_FAST_0xF4_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t SEL_32K_XTAL: 1;              // 00
        uint16_t SEL_32K_LP: 1;                // 01
        uint16_t BRWN_OUT_GATING: 1;           // 02
        uint16_t BRWN_OUT_RESET: 1;            // 03
        uint16_t WAIT_HV_DET: 1;               // 04
        uint16_t VIO2_RST_EN: 1;               // 05
        uint16_t VIO1_RST_EN: 1;               // 06
        uint16_t SWR_BY_CORE: 1;               // 07
        uint16_t LOP_DIS_BR_NWAKE: 1;          // 08
        uint16_t FW_PMU_SEQ: 1;                // 09
        uint16_t rsvd: 1;                      // 10
        uint16_t AON_DBG_SEL: 5;               // 15:11
    };
} BTAON_FAST_0xF4_TYPE;

/* 0x124 ( RG11X_MBIAS )
    02:00   rw
    03      rw  0: shutdown of FLASH PADs.                                                                  1'b0
    04      rw  0: select AON control, 1: core domain control.                                              1'b1
    05      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    06      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    07      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    08      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    09      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    10      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    11      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    12      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    13      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    14      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
    15      rw  0: 150K weakly pull. 1: 15K pull                                                            1'b0
*/
typedef union _BTAON_FAST_BT_PAD_SPI_FLASH_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t PAD_rsvd: 3;                  // 02:00
        uint16_t PAD_SPI_FLASH_SHDN: 1;        // 03
        uint16_t AON_PAD_SPI_FLASH_S: 1;       // 04
        uint16_t PAD_P3_PDPUC_5: 1;            // 05
        uint16_t PAD_P3_PDPUC_4: 1;            // 06
        uint16_t PAD_P4_PDPUC_1: 1;            // 07
        uint16_t PAD_P4_PDPUC_0: 1;            // 08
        uint16_t PAD_P3_PDPUC_3: 1;            // 09
        uint16_t PAD_P3_PDPUC_2: 1;            // 10
        uint16_t PAD_P3_PDPUC_1: 1;            // 11
        uint16_t PAD_P3_PDPUC_0: 1;            // 12
        uint16_t PAD_P2_PDPUC_7: 1;            // 13
        uint16_t PAD_P2_PDPUC_6: 1;            // 14
        uint16_t PAD_P2_PDPUC_5: 1;            // 15
    };
} BTAON_FAST_BT_PAD_SPI_FLASH_TYPE;

/* 0x12a ( RG11X_MBIAS )
    00      rw  for SHDN control of HW_RSTN I/O cell                                                        1'b1
    01      rw  to power down I/O cells for Serial Flash                                                    1'b1
    02      rw  to power down I/O cells at TOP side                                                         1'b0
    03      rw  to power down I/O cells at BOTTOM side                                                      1'b0
    04      rw  to power down I/O cells at LEFT side                                                        1'b0
    05      rw  power down AUXLDO2 power cell at TOP side                                                   1'b0
    06      rw  power down AUXLDO1 power cell at BOTTOM side                                                1'b0
    07      rw  power down PALDO power cell at BOTTOM side                                                  1'b0
    08      rw  power down USB power cell at TOP side                                                       1'b0
    11:09   rw
    12      rw  battery plug in wake up ploarity 0: high level wakeup 1: low level wakeup                   1'b0
    13      rw  battery plug in wake up enable                                                              1'b0
    14      rw  Adaptor plug in wake up ploarity 0: high level wakeup 1: low level wakeup                   1'b0
    15      rw  Adaptor plug in wake up enable                                                              1'b0
*/
typedef union _BTAON_FAST_BT_PWDPAD_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POWPAD1: 1;                   // 00
        uint16_t PWDPAD1_FLASH: 1;             // 01
        uint16_t PWDPAD1_TOP: 1;               // 02
        uint16_t PWDPAD1_BOT: 1;               // 03
        uint16_t PWDPAD1_LEFT: 1;              // 04
        uint16_t PWDPAD1_AUXLDO2: 1;           // 05
        uint16_t PWDPAD1_AUXLDO1: 1;           // 06
        uint16_t PWDPAD1_PALDO: 1;             // 07
        uint16_t PWDPAD1_USB: 1;               // 08
        uint16_t rsvd: 1;                      // 09
        uint16_t MFB_WKPOL: 1;                 // 10
        uint16_t MFB_WKEN: 1;                  // 11
        uint16_t BAT_WKPOL: 1;                 // 12
        uint16_t BAT_WKEN: 1;                  // 13
        uint16_t ADP_WKPOL: 1;                 // 14
        uint16_t ADP_WKEN: 1;                  // 15
    };
} BTAON_FAST_BT_PWDPAD_TYPE;

/* 0x12c
    05:00   rw
    06      rw  1: enable brown detection interrupt.                                                        1'b0
    07      rw  brwon out detection interrupt polarity. 0:low level trigger. 1: high level trigger          1'b1
    08      w1c brown out detection pending interrupt status.                                               1'b1
    09      rw  brown out block wakeup indicator, set as try to wakeup in LPS but in brwon out state        1'b1
    10      r   power on trap                                                                               1'b0
    11      r   bondign option from PAD.                                                                    1'b0
    12      r   the result of GPIO_WKUP_STS & gpio_wkup_int_en which is issued to CPU ISR                   1'b0
    13      r   1: enable gpio wakeup interrupt as GPIO_WKUP_STS = 1                                        1'b0
    14      w1c wakeup status                                                                               1'b1
    15      rw
*/
typedef union _BTAON_FAST_WK_STATUS_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t rsvd0: 6;                     // 05:00
        uint16_t brwn_int_en: 1;               // 06
        uint16_t brwn_int_pol: 1;              // 07
        uint16_t brwn_det_intr: 1;             // 08
        uint16_t wakeup_blk_ind: 1;            // 09
        uint16_t PAD_P2_0_I: 1;                // 10
        uint16_t PAD_BOOT_FROM_FLASH_I: 1;     // 11
        uint16_t gpio_wkup_int: 1;             // 12
        uint16_t gpio_wkup_int_en: 1;          // 13
        uint16_t GPIO_WKUP_STS: 1;             // 14
        uint16_t rsvd1: 1;                     // 15
    };
} BTAON_FAST_WK_STATUS_TYPE;

/* 0x13a ( RG11X_MBIAS )
    00      rw  driving current control of the PAD                                                          1'b0
    01      rw  driving current control of the PAD                                                          1'b0
    02      rw  driving current control of the PAD                                                          1'b0
    03      rw  driving current control of the PAD                                                          1'b0
    04      rw  driving current control of the PAD                                                          1'b0
    05      rw  driving current control of the PAD                                                          1'b0
    06      rw  driving current control of the PAD                                                          1'b0
    07      rw  driving current control of the PAD                                                          1'b0
    08      rw  driving current control of the SPI FLASH PAD                                                1'b0
    09      rw  driving current control of the SPI FLASH PAD                                                1'b0
    10      rw  driving current control of the SPI FLASH PAD                                                1'b0
    11      rw  driving current control of the SPI FLASH PAD                                                1'b0
    12      rw  driving current control of the SPI FLASH PAD                                                1'b0
    13      rw  driving current control of the SPI FLASH PAD                                                1'b0
    14      rw  driving current control of the SPI FLASH PAD                                                1'b0
    15      rw  driving current control of the SPI FLASH PAD                                                1'b0
*/
typedef union _BTAON_FAST_0x13A_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t PAD_P3_E3_5: 1;               // 00
        uint16_t PAD_P3_E3_3: 1;               // 01
        uint16_t PAD_P3_E3_4: 1;               // 02
        uint16_t PAD_P3_E3_2: 1;               // 03
        uint16_t PAD_P3_E2_5: 1;               // 04
        uint16_t PAD_P3_E2_4: 1;               // 05
        uint16_t PAD_P3_E2_3: 1;               // 06
        uint16_t PAD_P3_E2_2: 1;               // 07
        uint16_t PAD_SPI_FLASH_E5N: 1;         // 08
        uint16_t PAD_SPI_FLASH_E4N: 1;         // 09
        uint16_t PAD_SPI_FLASH_E3N: 1;         // 10
        uint16_t PAD_SPI_FLASH_E2N: 1;         // 11
        uint16_t PAD_SPI_FLASH_E5P: 1;         // 12
        uint16_t PAD_SPI_FLASH_E4P: 1;         // 13
        uint16_t PAD_SPI_FLASH_E3P: 1;         // 14
        uint16_t PAD_SPI_FLASH_E2P: 1;         // 15
    };
} BTAON_FAST_0x13A_TYPE;

/* 0x13c ( RG11X_MBIAS )
    02:00   rw  0: AON GPIO, 1: LED0, 2: LED1, 3: LED2, 4: CLK_REQ. valid as PAD_P2_S[0] eq. 0.                     3'b0
    05:03   rw  0: AON GPIO, 1: LED0, 2: LED1, 3: LED2, 4: CLK_REQ, 5: xtal clock. valid as PAD_P2_S[1] eq. 0.      3'b0
    08:06   rw  0: AON GPIO, 1: LED0, 2: LED1, 3: LED2, 4: CLK_REQ, 5: RTC_CLK. valid as PAD_P2_S[2] eq. 0.         3'b0
    11:09   rw  0: AON GPIO, 1: LED0, 2: LED1, 3: LED2. valid as AON_PAD_ADC_S[0] eq 0                              3'b0
    14:12   rw  0: AON GPIO, 1: LED0, 2: LED1, 3: LED2, 4: CLK_REQ. valid as AON_PAD_ADC_S[1] eq 0                  3'b0
    15      rw                                                                                                      1'b0
*/
typedef union _BTAON_FAST_0x13C_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t PAD_P2_0_CFG: 3;              // 02:00
        uint16_t PAD_P2_1_CFG: 3;              // 05:03
        uint16_t PAD_P2_2_CFG: 3;              // 08:06
        uint16_t PAD_ADC_0_CFG: 3;             // 11:09
        uint16_t PAD_ADC_1_CFG: 3;             // 14:12
        uint16_t rsvd0: 1;                     // 15
    };
} BTAON_FAST_0x13C_TYPE;

