wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x140 ( RG11X_MBIAS )
    00      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    01      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    02      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    03      rw  AON PAD pull enable                                                                         1'b0
    04      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    05      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    06      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    07      rw  AON PAD pull enable                                                                         1'b0
    08      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    09      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    10      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    11      rw  AON PAD pull enable                                                                         1'b0
    12      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    13      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    14      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    15      rw  AON PAD pull enable                                                                         1'b0
*/
typedef union _BTAON_FAST_0x140_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t AON_PAD_SPI_SIO1_O: 1;        // 00
        uint16_t AON_PAD_SPI_SIO1_OE: 1;       // 01
        uint16_t AON_PAD_SPI_SIO1_PD: 1;       // 02
        uint16_t AON_PAD_SPI_SIO1_PU_EN: 1;    // 03
        uint16_t AON_PAD_SPI_SIO0_O: 1;        // 04
        uint16_t AON_PAD_SPI_SIO0_OE: 1;       // 05
        uint16_t AON_PAD_SPI_SIO0_PD: 1;       // 06
        uint16_t AON_PAD_SPI_SIO0_PU_EN: 1;    // 07
        uint16_t AON_PAD_SPI_SCK_O: 1;         // 08
        uint16_t AON_PAD_SPI_SCK_OE: 1;        // 09
        uint16_t AON_PAD_SPI_SCK_PD: 1;        // 10
        uint16_t AON_PAD_SPI_SCK_PU_EN: 1;     // 11
        uint16_t AON_PAD_SPI_CSN_O: 1;         // 12
        uint16_t AON_PAD_SPI_CSN_OE: 1;        // 13
        uint16_t AON_PAD_SPI_CSN_PD: 1;        // 14
        uint16_t AON_PAD_SPI_CSN_PU_EN: 1;     // 15
    };
} BTAON_FAST_0x140_TYPE;

/* 0x142 ( RG11X_MBIAS )
    07:00   rw
    08      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    09      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    10      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    11      rw  AON PAD pull enable                                                                         1'b0
    12      rw  AON PAD output value. valid only if AON_PAD_SPI_FLASH_S = 0 and OE = 1                      1'b0
    13      rw  PAD output enable. valid only if AON_PAD_SPI_FLASH_S = 0                                    1'b0
    14      rw  1: PAD pull down, 0: PAD pull up. vaild if pull enable                                      1'b0
    15      rw  AON PAD pull enable                                                                         1'b0
*/
typedef union _BTAON_FAST_0x142_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t rsvd: 8;                      // 07:00
        uint16_t AON_PAD_SPI_SIO3_O: 1;        // 08
        uint16_t AON_PAD_SPI_SIO3_OE: 1;       // 09
        uint16_t AON_PAD_SPI_SIO3_PD: 1;       // 10
        uint16_t AON_PAD_SPI_SIO3_PU_EN: 1;    // 11
        uint16_t AON_PAD_SPI_SIO2_O: 1;        // 12
        uint16_t AON_PAD_SPI_SIO2_OE: 1;       // 13
        uint16_t AON_PAD_SPI_SIO2_PD: 1;       // 14
        uint16_t AON_PAD_SPI_SIO2_PU_EN: 1;    // 15
    };
} BTAON_FAST_0x142_TYPE;

/* 0x156 ( RG11X_MBIAS )
    05:00   rw  fractional part compensat . LSB : 1/2^13                                                    6'b0
    06      rw  1: LP_XTAL fractional part add lp_xtal_ppm_err, 0: minus lp_xtal_ppm_err                    1'b0
    07      rw                                                                                              1'b0
    15:08   rw  option register reserved for RFC LDO                                                        8'b0
*/
typedef union _BTAON_FAST_0x156_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t lp_xtal_ppm_err: 6;           // 05:00
        uint16_t lp_xtal_ppm_plus: 1;          // 06
        uint16_t rsvd: 1;                      // 07
        uint16_t LDO_RFC_OPT: 8;               // 15:08
    };
} BTAON_FAST_0x156_TYPE;

/* 0x158 ( RG11X_MBIAS )
    00      rw  1: RG2X_CHG[3:2] =2'b01@ST_PON_M1M2                                                         1'b1
                   RG2X_CHG[3:2] =2'b11@ST_PON_LDO533
*/
typedef union _BTAON_FAST_0x158_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t CHG_M2CCDFBSEL_eco_en: 1;              // 06:00
        uint16_t rsvd: 15;                  // 07
    };
} BTAON_FAST_0x158_TYPE;

/* 0x15e
    06:00   rw  the destination retention ldo voltage setting.                                              7'b101101
    15:08   rw  retention register step down delay for each step. unit 32k period (default: 2ms)            8'h40
*/
typedef union _BTAON_FAST_0x15E_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ldoret_tune6: 7;              // 06:00
        uint16_t LOP_rsvd: 1;                  // 07
        uint16_t LOP_POF_LDODIG_delay: 8;      // 15:08
    };
} BTAON_FAST_0x15E_TYPE;

