wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x160
    01:00   rw  2'b00: 31.25us, 2'b01: 62.5us, 2'b10: 125us, 2'b11: 250us                                   2'b00
    03:02   rw  2'b00: 31.25us, 2'b01: 62.5us, 2'b10: 125us, 2'b11: 250us                                   2'b11
    05:04   rw  2'b00: 31.25us, 2'b01: 62.5us, 2'b10: 125us, 2'b11: 250us                                   2'b11
    07:06   rw  2'b00: 31.25us, 2'b01: 62.5us, 2'b10: 125us, 2'b11: 250us                                   2'b11
    08      rw  1'b1: external XTAL 32.768K for Bluewiz                                                     1'b0
    09      rw  1'b1: internal low power 32K for Bluewiz                                                    1'b0
    10      rw  1'b1: external XTAL 32.768K for RTC                                                         1'b0
    11      rw  1'b1: internal low power 32K for RTC                                                        1'b0
    12      rw  1'b1: pass external XTAL 32.768K through P2_1                                               1'b0
    13      rw                                                                                              1'b0
    14      rw                                                                                              1'b0
    15      rw
*/
typedef union _BTAON_FAST_0x160_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ldopa_step_ctrl: 2;           // 01:00
        uint16_t ldo533_step_ctrl: 2;          // 03:02
        uint16_t ldoaux_step_ctrl: 2;          // 05:04
        uint16_t ldodig_step_ctrl: 2;          // 07:06
        uint16_t SEL_32K_XTAL_bt_systick: 1;   // 08
        uint16_t SEL_32K_LP_bt_systick: 1;     // 09
        uint16_t SEL_32K_XTAL_rtc: 1;          // 10
        uint16_t SEL_32K_LP_rtc: 1;            // 11
        uint16_t en_p21_ext_32k: 1;            // 12
        uint16_t USB_WKPOL: 1;                 // 13
        uint16_t USB_WKEN: 1;                  // 14
        uint16_t rsvd: 1;                      // 15
    };
} BTAON_FAST_0x160_TYPE;

/* 0x168 (RG0X_LDODIG)
    00      r   1: power on LDODIG, power on LDODIG after generate LDODIG_VREF with soft start              1'b0
    01      r   1: enable LDODIG Power Cut mode if POW_LDODIG = 1                                           1'b0
    02      rw                                                                                              1'b0
    07:03   r   output voltage of LDODIG (default 1.1V)                                                     5'b10110
    08      r   1: power on LDODIG_VREF                                                                     1'b0
    09      r   1: power on LDORET                                                                          1'b0
    10      rw  0: enable LDORET dummy load                                                                 1'b0
    15:11   rw  output voltage of LDORET (default 1.1V)                                                     5'b11000
*/
typedef union _BTAON_FAST_RG0X_LDODIG_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t POW_LDODIG: 1;                // 00
        uint16_t POW_LDODIG_PC: 1;             // 01
        uint16_t ENB_LDODIG_FB_LOCAL: 1;       // 02
        uint16_t TUNE_LDODIG_VOUT: 5;          // 07:03
        uint16_t POW_LDODIG_VREF: 1;           // 08
        uint16_t POW_LDORET: 1;                // 09
        uint16_t ENB_LDORET_DL: 1;             // 10
        uint16_t TUNE_LDORET_VOUT: 5;          // 15:11
    };
} BTAON_FAST_RG0X_LDODIG_TYPE;

/* 0x172
    00      rw  1: LDO_PA is controlled by H/W, 0: LDO_PA is controlled by F/W                              1'b1
    01      rw  1: 1MHz as system tick, 0: 32KHz as system tick                                             1'b0
    02      rw  1: to disable the step control of LDO_AUX/LDO533/LDODIG when re_power_on                    1'b0
    03      r                                                                                               1'b0
    04      rw  1: power on LDORET (F/W controlled)                                                         1'b0
    05      rw  1: power on LDO318 (F/W controlled)                                                         1'b0
    06      r                                                                                               1'b0
    07      rw  dummy                                                                                       1'b1
    08      rw  1: soft off is enabled for LDODIG                                                           1'b1
    09      rw  1: soft off is enabled for AUX HQ                                                           1'b1
    10      rw  1: soft off is enabled for LDO PA                                                           1'b1
    11      rw  1: soft off is enabled for LDO533                                                           1'b1
    12      rw  1: soft start is enabled for LDODIG (Note: It cannot be set to 1'b0 currently)              1'b1
    13      rw  1: soft start is enabled for AUX HQ                                                         1'b1
    14      rw  1: soft start is enabled for LDO PA                                                         1'b1
    15      rw  1: soft start is enabled for LDO533 (Note: It cannot be set to 1'b0 currently)              1'b1
*/
typedef union _BTAON_FAST_0x172_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t ldopa_step_ctrl_by_hw: 1;     // 00
        uint16_t r_clk_cpu_tick_sel: 1;        // 01
        uint16_t re_power_on: 1;               // 02
        uint16_t rsvd0: 1;                     // 03
        uint16_t LDODIG_POW_LDORET: 1;         // 04
        uint16_t MBIAS_POW_LDO318: 1;          // 05
        uint16_t rsvd1: 1;                     // 06
        uint16_t ldoret_step_on: 1;            // 07
        uint16_t soft_off_ldodig: 1;           // 08
        uint16_t soft_off_auxhq: 1;            // 09
        uint16_t soft_off_ldopa: 1;            // 10
        uint16_t soft_off_ldo533: 1;           // 11
        uint16_t soft_start_ldodig: 1;         // 12
        uint16_t soft_start_auxhq: 1;          // 13
        uint16_t soft_start_ldopa: 1;          // 14
        uint16_t soft_start_ldo533: 1;         // 15
    };
} BTAON_FAST_0x172_TYPE;

