wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl8763_syson_reg.h
/* 0x174
    07:00   rw
    15:08   rw  default: 3 ms                                                                               8'h30
*/
typedef union _BTAON_FAST_0x174_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_rsvd: 8;                  // 07:00
        uint16_t LOP_PON_LDO533_delay: 8;      // 15:08
    };
} BTAON_FAST_0x174_TYPE;

/* 0x176
    07:00   rw  default: 2 ms                                                                               8'h40
    15:08   rw  default: 2 ms                                                                               8'h40
*/
typedef union _BTAON_FAST_0x176_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_M1M2_delay: 8;        // 07:00
        uint16_t LOP_POF_LDO533_delay: 8;      // 15:08
    };
} BTAON_FAST_0x176_TYPE;

/* 0x178
    07:00   rw  default: 2 ms                                                                               8'h40
    08      rw  reserved by H/W                                                                             1'b1
    09      rw  reserved by H/W                                                                             1'b0
    10      rw  reserved by H/W                                                                             1'b0
    11      rw  reserved by H/W                                                                             1'b0
    15:12   rw
*/
typedef union _BTAON_FAST_0x178_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t LOP_POF_SWR_delay: 8;         // 07:00
        uint16_t auto_vg1_vg2: 1;              // 08
        uint16_t vg1_vg2_by_fw: 1;             // 09
        uint16_t vcore_pc_vg1_fw: 1;           // 10
        uint16_t vcore_pc_vg2_fw: 1;           // 11
        uint16_t rsvd: 4;                      // 15:12
    };
} BTAON_FAST_0x178_TYPE;

/* 0x17e
    00      rw  reg_anc_ff_en_wp    For ANC, enable the type of "Feed-Forward"                              1'b0
    01      rw  reg_anc_fb_en_wp    For ANC, enable the type of "Feed-Back"                                 1'b0
    02      rw  reg_anc_fbpn_en_wp  For ANC, enable the type of "FBPN"                                      1'b0
    03      rw  reg_anc_lms_en_wp   For ANC, enable the type of "LMS"                                       1'b0
    07:04   r   dummy                                                                                       4'h0
    09:08   rw  pfm2pwm_step_ctrl   2'b00: 31.25us, 2'b01: 62.5us, 2'b10: 125us, 2'b11: 250us               2'h0
    10      r   dummy                                                                                       1'b0
    11      rw  pfm2pwm_soft_start  1'b1: pfm2pwm soft start is enabled                                     1'b0
    15:12   r   dummy                                                                                       4'h0
*/
typedef union _BTAON_FAST_0x17E_TYPE
{
    uint8_t d8[2];
    struct
    {
        uint16_t reg_anc_ff_en_wp: 1;          // 00
        uint16_t reg_anc_fb_en_wp: 1;          // 01
        uint16_t reg_anc_fbpn_en_wp: 1;        // 02
        uint16_t reg_anc_lms_en_wp: 1;         // 03
        uint16_t rsvd0: 4;                     // 07:04
        uint16_t pfm2pwm_step_ctrl: 2;         // 09:08
        uint16_t rsvd1: 1;                     // 10
        uint16_t pfm2pwm_soft_start: 1;        // 11
        uint16_t rsvd2: 4;                     // 15:12
    };
} BTAON_FAST_0x17E_TYPE;

#endif /* _RTL8763_SYSON_REG_H */
